{
  "total": 50,
  "per_page": 6,
  "current_page": 1,
  "last_page": 9,
  "next_page_url": null,
  "prev_page_url": null,
  "from": 1,
  "to": 6,
  "data": [
    {
      "company": "Eternal Radiance Staffing Solutions Inc.",
      "company_logo": null,
      "company_url": null,
      "created_at": "Fri Jun 01 15:10:14 UTC 2018",
      "description": "<p>Purpose:</p>\n\n<p>The position has a dual responsibility providing general support to the Alliance General Manager and managing the general administration of the office.</p>\n\n<p>Key Responsibilities:</p>\n\n<pre><code>General office management including the induction and integration of new team members, organisation of workshops and other activities in the alliance project office together with catering requirements, managing car parking schedule and allocation of company vehicles.  Ordering all kitchen and office supplies and directing office cleaners.\n\nMaintaining ongoing, positive working relationships with all staff and senior management to facilitate progress\nMaintenance of the alliance document management and filing systems including data and statistics, leave records and related information.\nCo-ordinating any flights or accommodation requirements\nProvide orientation and assistance to, and undertake an administration induction of new site Office Administration staff, via the online induction facilities.\nMaintain petty cash and corporate credit card and reconciliation monthly.\nOngoing development and refinement of company policies and procedure relating to Office Management.\n</code></pre>\n\n<p>Skills and required Competencies</p>\n\n<pre><code>Advanced skills in Microsoft Word, Excel and Outlook.\nAbility to operate with minimal direction, prioritise work requirements and effectively manage time.\nAbility to communicate effectively at all levels.\nEnsure all documentation handled in a timely and confidential manner.\n</code></pre>",
      "how_to_apply": "<p>If this sounds like the type of role you have been looking for and you are interested in working for a known and respected organisation, engaged on projects which are helping to shape the future of , please apply now.</p>",
      "id": "7f544800-65ad-11e8-8ac0-4792349740b8",
      "location": "Calgary,AB ",
      "title": "Office Manager/Executive Assistant",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/7f544800-65ad-11e8-8ac0-4792349740b8"
    },
    {
      "company": "VodafoneZiggo",
      "company_logo": "http://github-jobs.s3.amazonaws.com/f46d4c7a-6596-11e8-8ae2-377dc0a93dd2.png",
      "company_url": "http://www.ziggo.nl",
      "created_at": "Fri Jun 01 12:29:26 UTC 2018",
      "description": "<p><b>IT OPERATIONS MANAGER</b><br></p>\n\n<p>Locatie: Amsterdam, Utrecht<br>\nErvaring: Professional<br>\nVakgebied: Customer Experience &amp; Digital<br>\nDienstverband: Fulltime<br>\nSluitingsdatum: Doorlopend<br></p>\n\n<p>Door jouw heldere en soepele processen kunnen onze klanten altijd op hollandsnieuwe rekenen.</p>\n\n<p><b>Dit doe je voor onze klant</b><br></p>\n\n<p>Altijd kunnen bellen en internetten, gemakkelijk je abonnement aanpassen en verlengen, de hollandsnieuwe App gebruiken, en nog veel meer: dankzij jou kunnen 600.000 klanten van hollandsnieuw zorgeloos gebruikmaken van die diensten en producten. Door aan te pakken, stappen te zetten en continu te kijken waar het beter kan. Door processen goed in te richten en te zorgen dat je leveranciers optimaal presteren. Want het is aan jou als onze IT operations manager om alle systemen en klantprocessen soepel te laten draaien. Vandaag, morgen en in de toekomst. Zo draag je bij aan de tevredenheid van onze klanten.<br></p>\n\n<p><b>Zó doe je dit</b><br>\n• haarscherp in de gaten houden van de verschillende klantprocessen en diensten. Je monitort, signaleert en verbetert<br></p>\n\n<ul>\n<li>oplossen van operationele problemen. Incidenteel en structureel. Als de techniek faalt, regel jij razendsnel een oplossing<br>\n</li>\n<li>managen van leveranciers. Van kpi’s tot kosten en kwaliteit: jouw leveranciers zorgen voor het allerbeste resultaat<br>\n• optimaal laten functioneren van (ITIL-)processen. Je doorgrondt en richt de processen goed in<br>\n</li>\n</ul><p><b>Jij versterkt</b><br>\nHollandsnieuwe is een jonge, dynamische telefoonaanbieder die de dingen net even anders doet. We staan voor openheid, een verfrissende nuchtere aanpak en voordeel. En hollandsnieuwe is een 100% dochteronderneming van VodafoneZiggo. Het hollandsenieuwe-team bestaat uit dertig medewerkers die allemaal op één vloer samen zitten er vol voor gaan. Ze hebben gevoel voor het merk en willen er samen écht wat moois van maken.  Binnen het vijftienkoppige team waar jij als IT operations manager hollandsnieuwe aan de slag gaat, werk je nauw samen met drie collega’s. Samen zorgen jullie dat hollandsnieuwe IT Operations loopt als een zonnetje. Jouw directe collega’s verstaan hun vak en hebben vaak aan twee woorden genoeg.<br></p>\n\n<p>“Vrijheid en aanpakken” staan bij jouw manager Alex Rinsmavoorop. “Binnen hollandsnieuwe is nog niet alles in beton gegoten en we zijn volop aan het bouwen. Ik zet de lijnen uit en geef de ruimte om je functie ook zelf invulling te geven. Leiderschapseigenschappen, een team dat goed samenwerkt en elkaar goed aanvoelt zijn binnen deze functie essentieel.” Jouw werkplek is nu Amsterdam en vanaf oktober 2018 wordt dat hartje Utrecht. Amsterdam óf Utrecht: allebei de kantoren zijn op loopafstand van een CS.<br></p>\n\n<p><b>Wij</b><br>\nVodafoneZiggo is een krachtenbundeling van twee sterke Nederlandse bedrijven. Samen vormen we sinds januari 2017 een ijzersterke combinatie in Nederland. Als communicatieprovider bieden we onze klanten het beste aan entertainment, mobiele telefonie, vaste telefonie en internet. Met onze producten en diensten inspireren we mensen, bedrijven en de samenleving om contact te maken. Of dat nu onderweg, thuis of op het werk is.<br></p>\n\n<p>Met meer dan 8.000 medewerkers zijn we vol energie, ambitieus en maatschappelijk betrokken. Trots op wat wij presteren en met wie we dit doen. Met voor ieder veel ruimte om zich te kunnen ontwikkelen en kansen te benutten.<br></p>\n\n<p><b>Jij hebt hét</b><br>\nEen karakter met pit, gecombineerd met technisch inzicht om de verantwoordelijkheid te pakken voor onze klantprocessen. Dit betekent dat je aanpakt, pragmatisch bent en meebeweegt in een organisatie die volop in beweging is. Jij geeft niet op en gaat door tot je de oplossing of het probleem hebt gevonden. Jij neemt het roer in eigen handen en organiseert je eigen werk, waarbij de samenwerking met en binnen het team bij jou voorop staat. Jij verbindt en voelt je snel thuis binnen een team. Ook heb je voor deze vacature van IT operations manager bij VodafoneZiggo:<br></p>\n\n<ul>\n<li>minimaal een diploma van een technische IT hbo-opleiding op zak<br>\n</li>\n<li>een aantal jaren werkervaring opgedaan met:<br>\n</li>\n<li>IT Operations, bij voorkeur in een (mobiele) telecom-omgeving<br>\n</li>\n<li>ITIL processen<br>\n</li>\n<li>reporting / SQL quering om rapportages, als het gaat om IT- (monitoring) en klantprocessen, te kunnen beheren<br>\n</li>\n<li>algemene kennis van complexe IT-systemen. Denk aan infrastructuur, systemen, netwerken en toepassinglogica<br>\n</li>\n<li>een analytisch inzicht waar je ‘u’ tegen zegt. Je ziet snel waar mogelijkheden liggen om  te blijven verbeteren<br>\n</li>\n<li>sterke communicatieve vaardigheden en beheersing van de Nederlandse taal<br>\n</li>\n</ul><p><b>Jij verdient het</b><br>\n• een ambitieuze werkgever. We willen het beste voor jou en je collega’s\n• een goed salaris. Feilloos afgestemd op je achtergrond</p>\n\n<ul>\n<li>financiële voordelen. Denk bijvoorbeeld aan een regeling met betrekking tot je verlof, pensioen en (andere) gunstige regelingen</li>\n<li>groeipotentie. Wij bieden de (door)groeimogelijkheden. Aan jou om deze te benutten</li>\n</ul><p><b>Jij doet het</b><br>\nAre you in? Ben jij de IT operations manager hollandsnieuwe die met heldere en soepele processen zorgt dat onze klanten altijd op hollandsnieuwe kunnen rekenen? Klik nu op de<b> 'Solliciteer' </b>button en reageer.\nHeb je vragen? Saskia Schmidt geeft jou het antwoord, stuur een bericht <a href=\"mailto:saskia.schmidt@vodafoneziggo.com\">saskia.schmidt@vodafoneziggo.com</a>\nDeze vacature staat voor onze open zoektocht naar een nieuwe VodafoneZiggo collega.</p>\n\n<p><i>Dit is dan ook géén oproep voor acquisitie.</i><br></p>\n\n<p><i>Trefwoorden: Vacature, Fulltime, Utrecht, IT Operations, IT manager.</i><br></p>",
      "how_to_apply": "<p><a href=\"https://ziggo.redirect.your-jobresponse.com/it_operations_manager_utrecht/210735/V819/solliciterenl\">Klik hier voor het sollicitatieformulier!</a></p>",
      "id": "2f68fd06-6597-11e8-8c1f-f43176ccd2f7",
      "location": "Utrecht",
      "title": "IT Operations Manager",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/2f68fd06-6597-11e8-8c1f-f43176ccd2f7"
    },
    {
      "company": "Numbrs Personal Finance AG",
      "company_logo": "http://github-jobs.s3.amazonaws.com/491ad066-6575-11e8-9e87-3856db7e76cc.png",
      "company_url": "https://www.numbrs.com/uk/",
      "created_at": "Fri Jun 01 09:17:40 UTC 2018",
      "description": "<p>Responsibilities include but are not limited to designing, developing, deploying, supporting, monitoring and troubleshooting large scale micro-service based distributed systems with high transaction volume. Applicants are also expected to participate in after-hours work.</p>\n\n<p><strong>All candidates will have</strong></p>\n\n<ul>\n<li>a Bachelor's or higher degree in technical field of study or equivalent practical experience</li>\n<li>a minimum of two years experience designing, developing and troubleshooting large scale distributed systems</li>\n<li>hands-on experience with highly concurrent production grade systems</li>\n<li>knowledge of at least one modern programming language, such as Go, Java, C++ and Scala, etc.</li>\n<li>troubleshooting and creative problem-solving abilities</li>\n<li>advanced written, oral communication and interpersonal skills</li>\n</ul><p><strong>Ideally, candidates will also have</strong></p>\n\n<ul>\n<li>experience with systems for automating deployment, scaling and management of containerised applications, such as Kubernetes and Mesos</li>\n<li>experience with big data technologies, such as Kafka, Spark, Storm, Flink and Cassandra</li>\n<li>experience with encryption and cryptography standards</li>\n</ul><p><a href=\"https://www.numbrs.com/uk/careers/open-positions/details#oXh76fwb\">Apply for this job</a></p>\n\n<p><strong>Location: Zurich, Switzerland</strong></p>",
      "how_to_apply": "<p>Please apply <a href=\"https://www.numbrs.com/uk/careers/open-positions/details#oXh76fwb\">here</a></p>",
      "id": "5ed9f044-6575-11e8-9eb2-d64c5efcc5b2",
      "location": "Zürich",
      "title": "Software Engineer, Backend",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/5ed9f044-6575-11e8-9eb2-d64c5efcc5b2"
    },
    {
      "company": "Axios",
      "company_logo": null,
      "company_url": "http://www.axios.com",
      "created_at": "Thu May 31 20:13:28 UTC 2018",
      "description": "<p>Quick Take: Axios is a new digital media company that tells you what matters and why to make you smarter, faster. We're hiring a Senior Android Engineer.</p>\n\n<p>Why it Matters: We need a Senior Android Engineer who will lead architecture and development work for our native reading and contributing tools for mobile devices. This is a high-visibility opportunity that will allow you to play a major role in shaping development culture and product architecture for a start-up that is unapologetically fixing media.</p>\n\n<p>Go Deeper: You recognize that apps should look and function in a way that feels native to the platform. You are the kind of Droid enthusiast who can help check iOS design bias and call out if something feels wrong or foreign.</p>\n\n<p>The Details: You don’t like doing blue bubble things in a green bubble world. You have worked on everything from the deep underpinnings of persistence architecture to building custom controls, all the way up to the fine polish of implementing engaging animations. We’re looking for the following skillset:</p>\n\n<p>-4+ years professional experience\n-Experience with at least one real world app in the Android app stores or a project you can show us\n-Demonstrated experience in Java, with familiarity in Kotlin\n-Deep knowledge of the Android platform, including the Android SDK and tools/frameworks such as --Android Studio and Gradle\n-Experience with performance profiling using Android Profiler\n-Experience with code signing and marketplace app distribution\n-Strong understanding of memory management and asynchronous programming\n-Experience developing heavily network-based apps that consume RESTful JSON APIs\n-Strong foundation in Google Material Design principles and guidelines\n-Understanding of distributed version control systems like Git\n-Familiarity with unit and automated UI testing\n-Experience with CI and automated deployment systems is a plus\n-Experience with iOS is a plus</p>\n\n<p>Don't Forget:\n-Competitive salary \n-Health insurance (100% paid for individuals, 75% for families)\n-Primary caregiver 12-week paid leave \n-401K\n-Generous vacation policy, plus company holidays\n-Company equity\n-Commuter and cell phone benefit\n-A commitment to an open, inclusive, and diverse work culture\n-Learning and development stipend\n </p>",
      "how_to_apply": "<p><a href=\"https://grnh.se/78ef6d531\">https://grnh.se/78ef6d531</a></p>",
      "id": "09369b44-650f-11e8-90ee-86c7b34ab45d",
      "location": "Remote, USA",
      "title": "Senior Android Developer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/09369b44-650f-11e8-90ee-86c7b34ab45d"
    },
    {
      "company": "Axios",
      "company_logo": "http://github-jobs.s3.amazonaws.com/2322f562-650e-11e8-9044-c456149080e9.png",
      "company_url": "http://www.axios.com",
      "created_at": "Thu May 31 20:09:10 UTC 2018",
      "description": "<p>Quick Take: Axios is a new digital media company that tells you what matters and why to make you smarter, faster. We're hiring a Senior iOS Engineer.</p>\n\n<p>Why it Matters: We need a Senior iOS Engineer who will lead architecture and development work for our native reading and contributing tools for mobile devices. This is a high-visibility opportunity that will allow you to play a major role in shaping development culture and product architecture for a start-up that is unapologetically fixing media.</p>\n\n<p>The Details: You have worked on everything from the deep underpinnings of persistence architecture to building custom controls, all the way up to the fine polish of implementing engaging animations. </p>\n\n<p>We’re looking for the following skillset:\n-4+ years professional experience</p>\n\n<p>-Demonstrated experience in Swift and Objective-C</p>\n\n<p>-Experience with at least one real-world app in the App Store or a project you can show us</p>\n\n<p>-Strong command of UIKit, Core Graphics, Core Animation, GCD, and Auto Layout</p>\n\n<p>-Experience with performance profiling using Xcode Instruments</p>\n\n<p>-Experience managing certificates, provisioning profiles, and the App Store distribution workflow</p>\n\n<p>-Strong understanding of memory management and asynchronous programming</p>\n\n<p>-Experience developing heavily network-based apps that consume RESTful JSON APIs</p>\n\n<p>-Understanding of distributed version control systems like Git</p>\n\n<p>-Familiarity with unit and automated UI testing (XCTest)</p>\n\n<p>-Exposure to dependency management (Cocoapods, frameworks, libraries, etc)</p>\n\n<p>-Experience with CI and automated deployment systems is a plus</p>\n\n<p>-Experience with Android is a plus</p>\n\n<p>Don't Forget:\n-Competitive salary </p>\n\n<p>-Health insurance (100% paid for individuals, 75% for families)</p>\n\n<p>-Primary caregiver 12-week paid leave </p>\n\n<p>-401K</p>\n\n<p>-Generous vacation policy, plus company holidays</p>\n\n<p>-Company equity</p>\n\n<p>-Commuter and cell phone benefit</p>\n\n<p>-A commitment to an open, inclusive, and diverse work culture</p>\n\n<p>-Learning and development stipend</p>",
      "how_to_apply": "<p><a href=\"https://grnh.se/27e485361\">https://grnh.se/27e485361</a></p>",
      "id": "5f8c255a-650e-11e8-8764-e219a186e02d",
      "location": "Remote, USA",
      "title": "Senior iOS Developer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/5f8c255a-650e-11e8-8764-e219a186e02d"
    },
    {
      "company": "BriteCore",
      "company_logo": "http://github-jobs.s3.amazonaws.com/1e3a5160-650b-11e8-8733-5a27288c5cb9.png",
      "company_url": "https://www.britecore.com",
      "created_at": "Thu May 31 19:58:25 UTC 2018",
      "description": "<p>The product development branch of the company is shaping the future of software in the insurance industry. We are rebuilding BriteCore from the ground up with a more modular and configurable architecture. We have some interesting challenges ahead, and want your help to build a robust platform for the development and deployment of our next-generation services.</p>\n\n<h4>Platform Team</h4>\n\n<p>The platform team is responsible for the foundations of our architecture. Our goal is to enable service engineers to build, test, and deploy their services in a stable and efficient manner.</p>\n\n<p>A few examples of what we are responsible for:</p>\n\n<ul>\n<li>Foundational AWS resources\n\n<ul>\n<li>VPCs</li>\n<li>ECS Cluster</li>\n</ul>\n</li>\n<li>Custom CloudFormation Resource Providers</li>\n<li>Shared IAM and S3 resources for CI/CD</li>\n<li>Re-useable CloudFormation templates\n\n<ul>\n<li>Service Pipeline (CodePipeline + CodeBuild)</li>\n<li>RDS Clusters</li>\n<li>AutoScaling templates</li>\n</ul>\n</li>\n<li>Foundational Services\n\n<ul>\n<li>Search</li>\n<li>Events</li>\n<li>Logs</li>\n</ul>\n</li>\n</ul><p>Your individual responsibilities will be up to your strengths and passions. If you really enjoy enabling and streamlining CI/CD, we can use that. If building scalable and resilient foundational services interests you, we have a place for you. If you excel at securing cloud resources for easy use in a DevOps model, we can use your skills.</p>\n\n<h4>Benefits and Compensation</h4>\n\n<ul>\n<li>$70k-$100k based on experience and proven performance</li>\n<li>A company-provided Macbook Pro</li>\n<li>Comprehensive health insurance coverage including medical, dental, and vision</li>\n<li>Flexible schedule</li>\n<li>Relaxed work environment</li>\n<li>Remote work</li>\n<li>Flexible learning time - explore your ideas and new technologies on the clock</li>\n</ul><h4>Technologies We Utilize</h4>\n\n<p>Here are some examples of technologies you will be using daily. Don't worry if you don't know all of these already. We care more about your ability and willingness to learn quickly.</p>\n\n<ul>\n<li>Amazon Web Services\n\n<ul>\n<li>CloudFormation</li>\n<li>CodeBuild</li>\n<li>CodePipeline</li>\n<li>Lambda</li>\n<li>S3</li>\n<li>ECS (Fargate)</li>\n<li>API Gateway</li>\n<li>DynamoDB</li>\n<li>RDS</li>\n<li>ElasticSearch</li>\n<li>Kinesis</li>\n</ul>\n</li>\n<li>Python</li>\n<li>Swagger (OpenAPI 2.0)</li>\n<li>GitHub (For code-specific collaboration)</li>\n<li>Slack (For general collaboration)</li>\n</ul><h4>Skills and Requirements</h4>\n\n<ul>\n<li>Welcome feedback and collaboration</li>\n<li>Self-direct</li>\n<li>Communicate clearly</li>\n<li>Follow emerging technologies</li>\n<li>Love learning new things</li>\n<li>Friendly, confident, and patient with others</li>\n<li>5+ years of professional experience</li>\n<li>2+ years of AWS experience</li>\n</ul><h4>Our Hiring Process</h4>\n\n<p>If you like what you see so far, here's how this is going to work.</p>\n\n<ul>\n<li>Put in an application with your resume</li>\n<li>We will review candidates and let you know if we want to move forward</li>\n<li>Complete a small project to demonstrate skills we want to see for this team</li>\n<li>We will review projects and select candidates for interviews</li>\n<li>Join us for an online video interview</li>\n<li>We will make a final decision</li>\n</ul><h4>About the Company</h4>\n\n<p>At BriteCore, we build gorgeous, scalable, and user-friendly cloud-based insurance software. This is a company founded by, and run by software engineers. We have created a team of top performers developing modern systems for the insurance industry. Our team enjoys working together, and takes tremendous pride and ownership in our platform. We love great technology and it shows in every aspect of our product. Our team enjoys a very flexible, balanced, and stimulating environment. We promote a high quality of life for our employees by allowing them to choose their own schedule and location. Bring creativity, focus, and productivity to your job, and enjoy 40 hour work weeks, flexible paid time off, and remote work.</p>",
      "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/britecorecom/view/P_AAAAAAEAAADNmvqa94xGss?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/britecorecom/view/P_AAAAAAEAAADNmvqa94xGss?trackingTag=gitHub</a></p>",
      "id": "75c138d0-650c-11e8-8ee5-49e66a292167",
      "location": "Remote",
      "title": "Product Development - Platform Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/75c138d0-650c-11e8-8ee5-49e66a292167"
    },
    {
      "company": "Our World in Data",
      "company_logo": "http://github-jobs.s3.amazonaws.com/6bae3d68-650a-11e8-837e-596bc9e37ad4.png",
      "company_url": "https://ourworldindata.org",
      "created_at": "Thu May 31 19:49:37 UTC 2018",
      "description": "<p>We are seeking to appoint a Front-end Developer to work on the development of the <a href=\"https://ourworldindata.org/\">Our World in Data project and website</a>, working under the direction of the Lead Developer, and the Programme Director Dr Max Roser.</p>\n\n<p>The postholder will be responsible for ensuring that the Our World in Data site is aesthetically pleasing whilst functioning perfectly and intuitively. In order to do this, your primary task will be a redesign and implementation of ourworldindata.org. Furthermore, you will work with the project team to design a new visual exploration tool to allow the public direct access to our database and make continual improvements to this through design and implementation of new types of interactive data visualisation.</p>\n\n<p>You will also liaise with the project team, technical staff in the wider University and, where appropriate, external institutions to ensure that Our World in Data functions according to design specifications, whilst making recommendations on future technology choices for website development.</p>\n\n<p>You should hold a bachelor’s degree in computer science, software engineering or have equivalent qualifications or experience, have a demonstrable portfolio of excellent web design projects that you have worked on, alongside strong knowledge of HTML, CSS and JavaScript.</p>\n\n<p>This full-time position is fixed term until 15th November 2021.</p>\n\n<p>Further particulars, including details of how to apply, can be obtained <a href=\"https://www.oxfordmartin.ox.ac.uk/downloads/134861_Front_End_Developer_JD.docx.pdf\">here</a>. Applications for this vacancy should be made online and you will be required to upload a CV and supporting statement as part of your application, which should include a sample of your code. </p>\n\n<p><strong>For more information and to apply, <a href=\"https://www.recruit.ox.ac.uk/pls/hrisliverecruit/erq_jobspec_version_4.display_form?p_company=10&amp;p_internal_external=E&amp;p_display_in_irish=N&amp;p_process_type=&amp;p_applicant_no=&amp;p_form_profile_detail=&amp;p_display_apply_ind=Y&amp;p_refresh_search=Y&amp;p_recruitment_id=134861\">please click here</a>.</strong></p>",
      "how_to_apply": "<p>For more information and to apply, <a href=\"https://www.recruit.ox.ac.uk/pls/hrisliverecruit/erq_jobspec_version_4.display_form?p_company=10&amp;p_internal_external=E&amp;p_display_in_irish=N&amp;p_process_type=&amp;p_applicant_no=&amp;p_form_profile_detail=&amp;p_display_apply_ind=Y&amp;p_refresh_search=Y&amp;p_recruitment_id=134861\">please click here</a>.</p>",
      "id": "a0854b48-650b-11e8-94ff-eccea3488bd1",
      "location": "University of Oxford",
      "title": "Front-end Developer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/a0854b48-650b-11e8-94ff-eccea3488bd1"
    },
    {
      "company": "Our World in Data",
      "company_logo": "http://github-jobs.s3.amazonaws.com/b13b51a2-64df-11e8-85b2-30287d77bb52.png",
      "company_url": "https://ourworldindata.org",
      "created_at": "Thu May 31 19:35:46 UTC 2018",
      "description": "<p>We are seeking to appoint a JavaScript Developer to work on the backend development of the <a href=\"https://ourworldindata.org/\">Our World in Data project and website</a>, working under the direction of the Lead Developer, and the Programme Director Dr Max Roser.</p>\n\n<p>The postholder will be responsible for maintaining a “living database” of regularly updated social and economic indicators from many different sources. You will also implement a new visual exploration tool which gives the public direct access to the database. Furthermore, you will work with both the research team and user requirements to ensure that Our World in Data’s digital portfolio is fully optimised for internal inputs and external use.</p>\n\n<p>You will also liaise with the project team, technical staff in the wider University and, where appropriate, external institutions to ensure that Our World in Data functions according to design specifications, whilst making recommendations on future technology choices for website development.</p>\n\n<p>You should hold a bachelor’s degree in computer science, software engineering or have equivalent qualifications or experience, which should include experience working on high-uptime, public-facing production websites and be an expert at writing JavaScript in both client- and server-side contexts.</p>\n\n<p>This full-time position is fixed term until 15th November 2021.</p>\n\n<p>Further particulars, including details of how to apply, can be obtained from <a href=\"https://www.oxfordmartin.ox.ac.uk/downloads/134862_JavaScript_Developer_JD.docx.pdf\">here</a>. Applications for this vacancy should be made online and you will be required to upload a CV and supporting statement as part of your application, which should include a sample of your code. </p>\n\n<p><strong>For more information and to apply, <a href=\"https://www.recruit.ox.ac.uk/pls/hrisliverecruit/erq_jobspec_version_4.display_form?p_company=10&amp;p_internal_external=E&amp;p_display_in_irish=N&amp;p_process_type=&amp;p_applicant_no=&amp;p_form_profile_detail=&amp;p_display_apply_ind=Y&amp;p_refresh_search=Y&amp;p_recruitment_id=134862\">please click here</a>.</strong></p>",
      "how_to_apply": "<p>For more information and to apply, <a href=\"https://www.recruit.ox.ac.uk/pls/hrisliverecruit/erq_jobspec_version_4.display_form?p_company=10&amp;p_internal_external=E&amp;p_display_in_irish=N&amp;p_process_type=&amp;p_applicant_no=&amp;p_form_profile_detail=&amp;p_display_apply_ind=Y&amp;p_refresh_search=Y&amp;p_recruitment_id=134862\">please click here</a>.</p>",
      "id": "52346e86-64e0-11e8-9736-1ce1dfce1ce8",
      "location": "University of Oxford",
      "title": "JavaScript Developer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/52346e86-64e0-11e8-9736-1ce1dfce1ce8"
    },
    {
      "company": "Crown Equipment",
      "company_logo": "http://github-jobs.s3.amazonaws.com/0b6b7c5a-64ff-11e8-89a0-d6fcf17bc860.png",
      "company_url": "http://www.crown.com",
      "created_at": "Thu May 31 18:32:36 UTC 2018",
      "description": "<p>Company Description:</p>\n\n<p>Crown Equipment Corporation is a leading innovator in world-class forklift and material handling equipment and technology. As one of the world’s largest lift truck manufacturers, we are committed to providing the customer with the safest, most efficient and ergonomic lift truck possible to lower their total cost of ownership.</p>\n\n<p>Job Responsibilities:</p>\n\n<p>The Java Application Developer 2 is a critical role within the Insite agile based cloud development team chartered to develop and deploy new global fleet and service management products.  The Java Application Developer 2 analyzes and evaluates existing or proposed systems and develops computer applications, systems and related procedures.   The Developer also prepares program specifications, codes, tests, and debugs computer applications.  This is a novice level position that reports to an Applications Development Supervisor, Solutions Architect or Manager and works closely with other Insite product development staff.  This position reports to and works under close supervision of a more senior staff member.</p>\n\n<p>Qualifications:</p>\n\n<p>Bachelor degree, preferably in Computer Science, Software Engineering, Information Systems, or related field, or 4 years systems programming experience\nTwo years of experience in Java/J2EE programming and analysis preferred\nTwo years of experience using Angular framework\nGood written, verbal, analytical, and interpersonal skills\nValid driver license and good driving record\nAbility to occasionally travel with overnight stays</p>\n\n<p>Work Authorization:</p>\n\n<p>Crown will only employ those who are legally authorized to work in the United States. This is not a position for which sponsorship will be provided. Individuals with temporary visas or who need sponsorship for work authorization now or in the future, are not eligible for hire.</p>\n\n<p>No agency calls please.</p>\n\n<p>Compensation and Benefits:</p>\n\n<p>Crown offers an excellent wage and benefits package for full-time employees including Health/Dental/Vision/Prescription Drug Plan, Flexible Benefits Plan, 401K Retirement Savings Plan, Life and Disability Benefits, Paid Holidays, Paid Vacation, Tuition Reimbursement, and much more.</p>\n\n<p>EO/AA Employer Minorities/Females/Protected Veterans/Disabled</p>",
      "how_to_apply": "<p><a href=\"https://career4.successfactors.com/career?career_ns=job_listing&amp;company=C0000169989P&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_US&amp;career_job_req_id=50745&amp;selected_lang=en_US&amp;jobAlertController_jobAlertId=&amp;jobAlertController_jobAlertName=&amp;_s.crb=RDPeZ2%2bKaGvlz%2fsevgR9hH31pkM%3d\">https://career4.successfactors.com/career?career_ns=job_listing&amp;company=C0000169989P&amp;navBarLevel=JOB_SEARCH&amp;rcm_site_locale=en_US&amp;career_job_req_id=50745&amp;selected_lang=en_US&amp;jobAlertController_jobAlertId=&amp;jobAlertController_jobAlertName=&amp;_s.crb=RDPeZ2%2bKaGvlz%2fsevgR9hH31pkM%3d</a></p>",
      "id": "daaa871c-6500-11e8-958e-3e62b93f08da",
      "location": "New Bremen and Troy OH",
      "title": "Java Developer 2",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/daaa871c-6500-11e8-958e-3e62b93f08da"
    },
    {
      "company": "GasBuddy",
      "company_logo": "http://github-jobs.s3.amazonaws.com/3d3357ce-64d4-11e8-9c1a-f243879c4a64.png",
      "company_url": "https://www.gasbuddy.com/",
      "created_at": "Thu May 31 13:13:14 UTC 2018",
      "description": "<p>At GasBuddy, we take pride in helping people by building innovative, comprehensive products for millions of gas station owners, fuel retailers and drivers on the road every day - and our world-class team is always up to the challenge. GasBuddy is a place that empowers employees to grow, build and thrive. Whether we’re releasing a new app feature or competing in ping pong tournaments, you’ll be a part of a team that puts in 110%.</p>\n\n<p>This is a remote, work from home role. GasBuddy is looking for a Senior Full-Stack Developer with a heavy focus on JavaScript to join us and lead the development and launch of new GasBuddy products on our consumer web properties. You will contribute towards the development of web properties, microservices, and internal tools. This is a small team that takes pride in their work and implements creative solutions. </p>\n\n<p>You will be part of a new team to assess, evaluate and rebuild GasBuddy.com. The site receives a tremendous amount of traffic,1 million unique hits per month, and we need to mirror the mobile experience on the website. If you want to build a first class product and have a real passion for connecting with users this is the role for you!</p>\n\n<p>What You'll Do:</p>\n\n<p>Work directly on gasbuddy.com and relevant web properties\nOpportunity to lead/mentor junior members of the team\nCollaborate with engineering and systems teams to deliver end-to-end solutions\nEncourage best practices for the web</p>\n\n<p>What We Seek:</p>\n\n<p>Strong ability with modern frontend JavaScript frameworks (Ember, Angular, Backbone, or React)\nNode.js experience\nBA/BS or equivalent work experience\n3+ years of full-stack web development\nProfessional experience with PostgreSQL or similar\nExperience with RESTful services\nData-informed product development: analytics, A/B testing, etc.\nAbility to work in a fast-paced, startup environment\nUnderstanding of SEO methodologies\nExperience with universal/isomorphic React\nExperience with building microservices\nExperience with agile methodologies\nExperience with accessibility standards\nAbout GasBuddy</p>\n\n<p>GasBuddy is a smartphone app connecting drivers with their Perfect Pit Stop™. GasBuddy is the leader in crowdsourced information to help drivers find the best gas prices, closest stations, friendliest service, cleanest restrooms, tastiest coffee and much more. GasBuddy is the leading source for the most accurate, real-time fuel prices at more than 140,000 gas stations in the U.S., Canada and Australia. The Company’s B2B Retailer Software-as-a-Service (SaaS), known as GasBuddy Business Pages, provide Fuel Marketers and Retailers their best opportunity to maintain their station information, manage their brand, and promote to their target consumer audience. For more information, visit www.gasbuddy.com. </p>\n\n<p>GasBuddy is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regards to race, color, religion, sex, age, disability, military status, national origin or any other characteristic protected under federal, state or applicable local law.</p>\n\n<p>To all recruitment agencies: GasBuddy does not accept agency resumes. Please do not forward resumes to our jobs alias, GasBuddy employees or any other company location. GasBuddy is not responsible for any fees related to unsolicited resumes. Unsolicited resumes received will be considered our property and will be processed accordingly.</p>",
      "how_to_apply": "<p>Email your resume to Jennifer Ramcharan at <a href=\"mailto:jramcharan@gasbuddy.com\">jramcharan@gasbuddy.com</a></p>",
      "id": "40fefee4-64d4-11e8-9ad1-d55f52a9ce23",
      "location": "California",
      "title": "Senior Full Stack Developer (Work From Home)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/40fefee4-64d4-11e8-9ad1-d55f52a9ce23"
    },
    {
      "company": "GasBuddy",
      "company_logo": "http://github-jobs.s3.amazonaws.com/d9b9a39c-64d3-11e8-9447-36f6c850c5e5.png",
      "company_url": "https://www.gasbuddy.com/",
      "created_at": "Thu May 31 13:10:42 UTC 2018",
      "description": "<p>At GasBuddy, we take pride in helping people by building innovative, comprehensive products for millions of gas station owners, fuel retailers and drivers on the road every day - and our world-class team is always up to the challenge. GasBuddy is a place that empowers employees to grow, build and thrive. Whether we’re releasing a new app feature or competing in ping pong tournaments, you’ll be a part of a team that puts in 110%.</p>\n\n<p>This is a remote, work from home role. GasBuddy is looking for a Senior Full-Stack Developer with a heavy focus on JavaScript to join us and lead the development and launch of new GasBuddy products on our consumer web properties. You will contribute towards the development of web properties, microservices, and internal tools. This is a small team that takes pride in their work and implements creative solutions. </p>\n\n<p>You will be part of a new team to assess, evaluate and rebuild GasBuddy.com. The site receives a tremendous amount of traffic,1 million unique hits per month, and we need to mirror the mobile experience on the website. If you want to build a first class product and have a real passion for connecting with users this is the role for you!</p>\n\n<p>What You'll Do:</p>\n\n<p>Work directly on gasbuddy.com and relevant web properties\nOpportunity to lead/mentor junior members of the team\nCollaborate with engineering and systems teams to deliver end-to-end solutions\nEncourage best practices for the web</p>\n\n<p>What We Seek:</p>\n\n<p>Strong ability with modern frontend JavaScript frameworks (Ember, Angular, Backbone, or React)\nNode.js experience\nBA/BS or equivalent work experience\n3+ years of full-stack web development\nProfessional experience with PostgreSQL or similar\nExperience with RESTful services\nData-informed product development: analytics, A/B testing, etc.\nAbility to work in a fast-paced, startup environment\nUnderstanding of SEO methodologies\nExperience with universal/isomorphic React\nExperience with building microservices\nExperience with agile methodologies\nExperience with accessibility standards\nAbout GasBuddy</p>\n\n<p>GasBuddy is a smartphone app connecting drivers with their Perfect Pit Stop™. GasBuddy is the leader in crowdsourced information to help drivers find the best gas prices, closest stations, friendliest service, cleanest restrooms, tastiest coffee and much more. GasBuddy is the leading source for the most accurate, real-time fuel prices at more than 140,000 gas stations in the U.S., Canada and Australia. The Company’s B2B Retailer Software-as-a-Service (SaaS), known as GasBuddy Business Pages, provide Fuel Marketers and Retailers their best opportunity to maintain their station information, manage their brand, and promote to their target consumer audience. For more information, visit www.gasbuddy.com. </p>\n\n<p>GasBuddy is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regards to race, color, religion, sex, age, disability, military status, national origin or any other characteristic protected under federal, state or applicable local law.</p>\n\n<p>To all recruitment agencies: GasBuddy does not accept agency resumes. Please do not forward resumes to our jobs alias, GasBuddy employees or any other company location. GasBuddy is not responsible for any fees related to unsolicited resumes. Unsolicited resumes received will be considered our property and will be processed accordingly.</p>",
      "how_to_apply": "<p>Email your resume to Jennifer Ramcharan at <a href=\"mailto:jramcharan@gasbuddy.com\">jramcharan@gasbuddy.com</a></p>",
      "id": "de02d23e-64d3-11e8-9ed9-c53e63b374d6",
      "location": "Work From Home",
      "title": "Senior Full Stack Developer (Work From Home)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/de02d23e-64d3-11e8-9ed9-c53e63b374d6"
    },
    {
      "company": "Picnic",
      "company_logo": null,
      "company_url": "https://join.picnic.nl",
      "created_at": "Thu May 31 13:10:27 UTC 2018",
      "description": "<p>Picnic is an app-only supermarket. We’re data driven with software at our core. Our world-class developers write immaculate code to support the world’s fastest growing supermarket. We’re on a quest for like-minded people to be part of the future of digital grocery shopping.</p>\n\n<p><strong>Where you fit in</strong></p>\n\n<p>Our developers are integrated, involved, and essential to each part of our company. From route planning, scaling our customer analytics to handle millions of messages, to how many bananas we should have in our warehouse on a Thursday – they write, plan, and predict.</p>\n\n<p>As one of our Java Developers, you take ownership of projects, learn, and work collaboratively with your colleagues. You constantly design, test, evolve, and evaluate the nuts and bolts of our operation while offering a creative and analytical approach.</p>\n\n<p>The high-quality code that stems from your fingertips is stylish, sexy, and robust. You just love to build ultra-scalable systems. You’re at home writing platforms and you display an intricate understanding of how each line of code fits into a business plan.</p>\n\n<p>Your skills will be complemented with the latest tech. We are committed to pushing development wherever possible. When you arrive you’ll be working with Java 8, but soon you’ll help us make the transition to Java 9.</p>\n\n<p>At Picnic we have diverse projects to keep you interested. Think you should focus on Android development? That’s fine - you’ll have the freedom to experiment and evolve your own abilities.</p>\n\n<p>We don’t hide our developments. We open-source with the community that helped us grow. If you require more motivation to apply - check out our page:  <a href=\"http://picnic.tech\">http://picnic.tech</a></p>\n\n<p><strong>What you do</strong></p>\n\n<ul>\n<li>Design, develop, and test new user-facing features of our platform</li>\n<li>Create high-quality code that is scalable, reliable and reusable</li>\n<li>Innovate and advance the core planning, shopping, retailing and shipment algorithms</li>\n<li>Optimise supply chain systems to maximize operational performance and efficiency</li>\n<li>Analyse and improve the scalability and security of our platform</li>\n<li>Manage individual project priorities, deadlines and deliverables</li>\n</ul><p><strong>What you need</strong></p>\n\n<ul>\n<li>Bachelor’s Degree in Computer Science or related technical field</li>\n<li>1-3 years experience in Programming and Software Development</li>\n<li>Profound understanding of back-end development (Java, Spring MVC, MongoDB, Elastic, \nPostgreSQL)</li>\n<li>Critical thinking and initiative: Hands-on, nothing-is-impossible mindset</li>\n<li>Mental athleticism: Highly analytical and curious intellect</li>\n<li>Out-of-the-box thinking: Ability to translate business requirements into high-performing scalable \nsolutions</li>\n<li>Superb communication: Capacity to articulate technical problems and projects to all teams</li>\n</ul><p><strong>Technologies we use</strong></p>\n\n<ul>\n<li>Java 8 (RxJava and Spring), Python, JavaScript (TypeScript)</li>\n<li>ElasticSearch, RabbitMQ, Kinesis</li>\n<li>NPM, Yarn, Webpack</li>\n<li>Maven and Git</li>\n<li>PostgreSQL (PostGIS), MongoDB, Redshift (Spectrum), Athena</li>\n<li>Hadoop, Spark, Elastic MapReduce (EMR)</li>\n<li>AWS, Docker, Kubernetes, Kops, Terraform, Vault, Packer</li>\n</ul>",
      "how_to_apply": "<p>Interested? You can apply via this link, <a href=\"https://grnh.se/9d9668b41\">https://grnh.se/9d9668b41</a></p>",
      "id": "b7148452-64c3-11e8-815a-f5a744caf23a",
      "location": "Amsterdam",
      "title": "Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/b7148452-64c3-11e8-815a-f5a744caf23a"
    },
    {
      "company": "FindKeep.Love",
      "company_logo": "http://github-jobs.s3.amazonaws.com/0ae0da82-64c8-11e8-8944-968695c42a54.png",
      "company_url": "http://www.findkeep.love",
      "created_at": "Thu May 31 11:46:15 UTC 2018",
      "description": "<p>IMPORTANT: <strong>Please provide all of the following with your resume: cover letter, hourly salary requirements, and code sample for review</strong></p>\n\n<p>The Role: We are looking for a python developer to help us with development and maintenance of an internal technology stack for our site, FindKeep.Love. This position presents an opportunity to work from home for a growing marketing company that respects work-life balance and values efficient, high-performing employees.</p>\n\n<p>The Company: We are experts in customer acquisition, and our site FindKeep.Love is a growing sweepstakes platform that allows brands and consumer facing companies to grow their email lists. We connect brands together for upcoming co-sponsored sweepstakes opportunities. Our sweepstakes advertising product allows brands to reach relevant consumer audiences at scale and acquire more customers.</p>\n\n<p>This role will require a candidate who has flexibility to check in with our Product Manager in the evenings (on pacific standard time).</p>\n\n<p>Responsibilities</p>\n\n<p>Development and maintenance of internal technology stack currently built in Python.</p>\n\n<p>Requirements</p>\n\n<ul>\n<li>B.S. or higher studies in Computer Science or related discipline (or equivalent experience)\n3+ years’ experience</li>\n<li>Expert knowledge in Python, with proficiency in least one Python web framework (e.g. Django, Flask, Pyramid)</li>\n<li>Strong working knowledge of relational databases (MySQL, PostgreSQL, etc...) and Python ORM libraries required</li>\n<li>Experience with Python testing, automation, and profiling tools</li>\n<li>Comfort with simple front-end web-development technologies including React/Angular/Bootstrap</li>\n</ul><p>IMPORTANT: <strong>Please provide all of the following with your resume: cover letter, hourly salary requirements, and code sample for review</strong></p>",
      "how_to_apply": "<p>Email your resume, cover letter (with hourly salary requirements), and code sample to <a href=\"mailto:hello@findkeep.love\">hello@findkeep.love</a></p>",
      "id": "1e9cddb4-64c8-11e8-98db-5d0586dde43d",
      "location": "Work from Home",
      "title": "Contract Hourly Python Developer, Remote",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/1e9cddb4-64c8-11e8-98db-5d0586dde43d"
    },
    {
      "company": "MyHammer AG",
      "company_logo": "http://github-jobs.s3.amazonaws.com/bfcfa790-64b2-11e8-9db0-3a7635d0dddd.png",
      "company_url": "http://www.my-hammer.de",
      "created_at": "Thu May 31 09:15:09 UTC 2018",
      "description": "<p>MyHammer ist Deutschlands Handwerkerportal Nr. 1. Wir helfen Auftraggebern, den richtigen Handwerker für Projekte rund um Haus und Garten zu finden. Das Spektrum reicht von kompletten Baumaßnahmen über Reparaturen und Wohnungsrenovierungen bis hin zu\nUmzügen. MyHammer finanziert sich über regelmäßige Beitragszahlungen der registrierten Handwerker, für Auftraggeber ist die Nutzung des Portals kostenlos.</p>\n\n<p>Die MyHammer AG gehört mehrheitlich zur amerikanischen HomeAdvisor International Gruppe und ist Teil eines europäischen Verbunds von Handwerkerplattformen. Unser Team von derzeit rund 100 Mitarbeitern und Mitarbeiterinnen arbeitet in einem modernen Büro in Berlin Charlottenburg.</p>\n\n<p>Wir wollen weiter wachsen und unsere Marktstellung weiter festigen. Dazu suchen wir schnellstmöglich einen</p>\n\n<p>Senior PHP Backend Developer (m/w)</p>\n\n<p>der gerne in einem interdisziplinären Team zusammen mit Product Ownern, Designern und Front- und Backend Developern arbeitet und mittels unserer agilen Arbeitsweise eigenverantwortlich und proaktiv am Unternehmenserfolg mitwirken möchte. In dieser Funktion\nberichtest Du direkt an den Head of Software Development.</p>\n\n<p>Auf Dich warten folgende Aufgaben</p>\n\n<ul>\n<li>Als Mitglied unseres Scrum-Teams erarbeitest Du die exakten Anforderungen der User Stories und setzt die Anforderungen testgetrieben und mittels Pair Programming effizient um</li>\n<li>Deine fachliche Expertise bringst Du team- und fachübergreifend ein, um auch weniger erfahrene Kollegen und Kolleginnen weiterzuentwickeln</li>\n<li>Du unterstützt bei der architektonischen Weiterentwicklung der Gesamtarchitektur</li>\n<li>Du engagierst Dich zusammen mit den anderen Entwicklern unseres Unternehmens bei der kontinuierlichen Verbesserung unserer internen Entwicklungsumgebung</li>\n<li>Du bringst Dich mit Deinem Wissen und Deinen Kompetenzen ein, um unsere Plattform, unsere Entwicklungsumgebung und den agilen Entwicklungsprozess stetig zu optimieren</li>\n</ul><p>Was wir uns wünschen</p>\n\n<ul>\n<li>Ein abgeschlossenes Studium der Informatik oder eine vergleichbare Ausbildung</li>\n<li>Du verfügst über mindestens 5 Jahre praktische Erfahrungen in der objektorientierten Softwareentwicklung</li>\n<li>Du besitzt ein ausgeprägtes Qualitätsbewusstsein mit Fokus auf Clean Code und testgetriebener Entwicklung</li>\n<li>Du zeichnest Dich durch eine gute Kommunikations- und Teamfähigkeit aus, um im Dialog mit Product Ownern und Teamkollegen optimale Lösungen für die Kunden zu ermitteln</li>\n<li>Du weist eine selbstständige und pragmatische Arbeitsweise mit hohem Qualitätsbewusstsein und ausgeprägter Hands-on-Mentalität auf</li>\n<li>Du beherrschst PHP7/Symfony3, MySQL und REST-Schnittstellen sicher</li>\n<li>Du hast schon mal mit Message Queues und Solr sowie Designpatterns und Continuous-Deployment gearbeitet</li>\n<li>Du besitzt ausgeprägte Puppet, Docker und AWS-Kenntnisse</li>\n<li>Sehr gute Englischkenntnisse runden Dein Profil ab</li>\n</ul><p>Was wir bieten</p>\n\n<ul>\n<li>Ein dynamisches Team, das im Zentrum der Hauptstadt die Zukunft eines der größten Bereiche unserer Volkswirtschaft mitgestaltet</li>\n<li>Wir fördern und fordern Teamwork: Im Zentrum steht bei uns das Scrum-Team</li>\n<li>Deine persönliche Weiterentwicklung fördern wir durch regelmäßige Feedbackgespräche, Wissensaustauch und Weiterbildungen</li>\n<li>Eine gewachsene Unternehmenskultur mit viel Raum für Eigeninitiative und Individualität</li>\n<li>Frisches Obst und freie Getränke gibt es selbstverständlich auch!</li>\n</ul><p>Findest Du dich in der Beschreibung wieder? Dann freuen wir uns auf Deine Bewerbung (im PDF-Format inkl. Gehaltsvorstellung undfrühestmöglichem Eintrittsdatum) per E-Mail an <a href=\"mailto:karriere@myhammer.de\">karriere@myhammer.de</a>.</p>",
      "how_to_apply": "<p><a href=\"mailto:karriere@myhammer.de\">karriere@myhammer.de</a></p>",
      "id": "f4e48b80-64b2-11e8-9dd4-090061caa39b",
      "location": "Berlin, Germany",
      "title": "Senior PHP Backend Developer (m/w)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/f4e48b80-64b2-11e8-9dd4-090061caa39b"
    },
    {
      "company": "GemFair",
      "company_logo": "http://github-jobs.s3.amazonaws.com/4e771a40-64aa-11e8-86db-0c0a39b1e01b.jpg",
      "company_url": "https://gemfair.com/",
      "created_at": "Thu May 31 08:14:20 UTC 2018",
      "description": "<p><strong>Senior Front End Engineer (Mobile)</strong></p>\n\n<p>As a Senior Front End Engineer, you are based in London, and you will own the frontend development on all mobile products that are both internal and external facing, such as the field app that miners use to register artisanal diamonds from the mine. GemFair will soon pilot in Sierra Leone, and as one of the early employees in this new initiative, you will have the opportunity to take an active role in strategic decisions and the overall direction of the venture.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Lead the development of our Android tablet app</li>\n<li>Develop robust offline first experience</li>\n<li>Improve our build process and deployment</li>\n<li>Collaborate with a team of engineers, designers and key individuals to deliver empowering user experiences</li>\n<li>Communicate ideas with cross-functional teams in an effective manner</li>\n</ul><p><strong>Requirements</strong></p>\n\n<ul>\n<li>2+ years of experience as a mobile and/or web interface developer</li>\n<li>Experience using React Native to build great mobile applications</li>\n<li>Some exposure to designing / building offline first mobile applications</li>\n<li>Experience with state management libraries such as Redux or Mobx</li>\n<li>Experience of JavaScript ES6</li>\n<li>Excited to learn and develop personally</li>\n</ul><p><strong>Desired</strong></p>\n\n<ul>\n<li>Some exposure to designing / building offline first mobile applications</li>\n</ul>",
      "how_to_apply": "<p>Please send CVs to <a href=\"mailto:jobs@gemfair.com\">jobs@gemfair.com</a></p>",
      "id": "78421906-64aa-11e8-9a62-f64e28447bd2",
      "location": "London",
      "title": "Front End Engineer (Mobile)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/78421906-64aa-11e8-9a62-f64e28447bd2"
    },
    {
      "company": "censhare AG",
      "company_logo": "http://github-jobs.s3.amazonaws.com/8e66e71e-649d-11e8-8987-15a6c1500f5b.jpg",
      "company_url": "https://www.censhare.com/",
      "created_at": "Thu May 31 06:42:58 UTC 2018",
      "description": "<p><strong>Senior Frontend Developer (w/m)</strong></p>\n\n<p><strong>The censhare Digital Experience Platform pools all marketing and communications content into one information-centric system and consistent user interface. All over the world, leading companies and brands place their trust in censhare to integrate and automate their communications. These activities are driven and advanced by more than 300 employees across the world, with censhare locations in Germany, Switzerland, UK, France, USA, the Netherlands, Sweden and India.</strong></p>\n\n<p>We are currently experiencing a steep growth path and offer plenty of open positions, among them: </p>\n\n<p><strong>Senior Frontend Developer - Innovation Team (m/f)</strong></p>\n\n<p>Munich | Next possible entry date | unlimited contract</p>\n\n<p><strong>Why you?</strong><br><strong>Because you love new challenges:</strong></p>\n\n<ul>\n<li>Development of browser-based applications using our JavaScript/Angular framework</li>\n<li>Help to build up our censhare Innovation Team in order to work on new innovative product ideas</li>\n<li>Creating and testing innovative MVPs and prototypes</li>\n<li>Close interaction with customers, partners and colleagues in order to get feedback on your ideas, concepts and prototypes</li>\n<li>Qualification and handover of prototypes and MVPs to our Product Development teams.</li>\n</ul><p><strong>Because you have to offer a lot:</strong></p>\n\n<ul>\n<li>Advanced understanding of JavaScript (you really know about scoping, hoisting, closures and prototypal / differential inheritance or promises)</li>\n<li>Experience in building large JavaScript applications using AngularJS (we are migrating to Angular)</li>\n<li>Good TypeScript knowledge</li>\n<li>Good English communication skills - our team consists of multiple nationalities</li>\n</ul><p><strong>It would be a big plus if you have experience with:</strong></p>\n\n<ul>\n<li>… CSS and responsive design</li>\n<li>… Java - our backend is implemented in Java</li>\n<li>… Content and Collaboration Management Systems</li>\n<li>… UX/UI</li>\n</ul><p><strong>Because being a Senior Frontend Developer (m/f) at censhare matters:</strong><br>\nAs a Senior Frontend Developer in our Innovation Team you will be working on a sophisticated and complex product used by over 150 mostly large customers. With over 300.000 lines of code, you will have the chance to push JavaScript to its limits and work with a broad set of technologies. The job also has a strong focus on architecture. Our recently founded international Innovation Team has the strategic goal to creatively develop and test new MVPs in close cooperation with specialists on customer and industry side. You have the possibility to further shape this team, to commonly decide which results are handed over to our Development Teams and to influence the future face of our product. </p>\n\n<p><strong>Why us?</strong></p>\n\n<ul>\n<li>Because we have a lot to offer! </li>\n<li>Continuous Feedback</li>\n<li>Flexible working hours / Home Office</li>\n<li>Pulse Surveys, Circles</li>\n<li>Coffee, water, fruit, Lunch Offer</li>\n<li>Gympass</li>\n</ul><p><strong>Because we are censhare!</strong></p>\n\n<ul>\n<li>We count on flat hierarchies and quick decision-making channels. Every employee has the possibility to contribute to the company's development.</li>\n<li>We are working with highly motivated, competent colleagues coming from more than 30 different nations using cutting-edge technologies across cultures.</li>\n<li>You can work on projects for world-renowned brands (just take look at our clients list).</li>\n<li>We care about people. We value and respect every person for what they are and for the input they can bring with their individual background to our team.</li>\n</ul><p><strong>Sounds interesting? Then let's talk!</strong><br>\nIf you are interested in this exciting challenge, we look forward to receiving your application. Please submit your application in either German or English via the <strong>link</strong> at the right side, and don't forget to mention your salary expectations as well as your earliest possible start date. We look forward to hearing from you!<br><br><a href=\"https://censhare.redirect.your-jobresponse.com/senior_frontend_developer_m_f_muenchen/208855/V819/anwenden\">https://www.censhare.com/de/wer-wir-sind/karriere/jobs/senior-frontend-developer</a> <br><br>\nIf you have any questions, please reach out to Robert Motzke by e-mail at: recruiting@censhare.com.<br><br><em>Keywords: Vacancy, Full-time, München, Senior Developer, Software Engineer, Frontend Developer, JavaScript, AngularJS.</em></p>",
      "how_to_apply": "<p><a href=\"https://censhare.redirect.your-jobresponse.com/senior_frontend_developer_m_f_muenchen/208855/V819/anwenden\">Click here to apply online!</a></p>",
      "id": "bad3b3ea-649d-11e8-89f5-585d8a72a748",
      "location": "München",
      "title": "Senior Frontend Developer (m/f)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/bad3b3ea-649d-11e8-89f5-585d8a72a748"
    },
    {
      "company": "KLA-Tencor",
      "company_logo": "http://github-jobs.s3.amazonaws.com/789e3faa-645b-11e8-857d-7755a6c22cd8.PNG",
      "company_url": "https://www.kla-tencor.com/",
      "created_at": "Wed May 30 22:49:33 UTC 2018",
      "description": "<p>Company Overview Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.</p>\n\n<p>Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?</p>\n\n<p>Group/Division The Global Products Group (GPG) is the world leader in the design and manufacture of advanced optical inspection and metrology tools for inline monitoring of process defects in advanced semiconductor factories. We are seeking a Software Engineer to join a world class team of engineers and scientists working on a leading optical inspection tool for the semiconductor industry. </p>\n\n<p>Responsibilities We are looking for passionate professionals to join our team! You will be a key member of our highly integrated multi-disciplinary team of software, systems, applications and algo engineers. You will be responsible for development of highly scalable service orientated software application to execute machine learning algorithms, seamlessly move high volumes of data across components </p>\n\n<p>You will be responsible for requirement analysis, design, implementing and testing software solutions to solve some of the most advanced technical challenges facing the industry. You will fit right in if you have a sound understanding of the fundamentals of Computer Science and practical experience building scalable and high performance computing software. You should be somebody who enjoys working on complex system software, is very customer-centric, understands the big picture and feels strongly not only about building good software but about making that software achieve its goals in reality.</p>\n\n<p>Preferred\n•Development experience with Service Oriented Architecture Design and implementation for large scale systems\n•Experience with Object-Oriented Software Analysis and Design using UML modeling\n•Strong software development skills in one or more programing language (Java, C#, C++, Python)\n•Experience designing web solutions on distributed storage and computing platforms\n•Experience building REST web services and reusable software components\n•Working knowledge of Linux\n•Hands-on SQL or NoSQL experience\n•Experience working with modern tools for distributed computing (like Apache Spark, Mesos, Hadoop, Kafka etc.)\n•Excellent mathematical and analytical skills\n•Work in an agile based development environment Good to have skills:\n•Familiarity with DL frameworks is a plus (e.g., Tensorflow)\n•Experience working on large scale storage technologies a plus</p>\n\n<p>Minimum Qualifications \n•Doctorate (Academic) with at least 2 years of experience OR\n•Master's Level Degree with at least 4 years of experience OR\n•Bachelor's Level Degree with at least 5 years of experience </p>\n\n<p>Equal Employment Opportunity KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law.</p>\n\n<p>Please come to our careers site to see all of our available openings and apply: \n<a href=\"http://www.kla-tencor.com/careers\">http://www.kla-tencor.com/careers</a></p>\n\n<p>For more information about KLA-Tencor as a company please visit: \n<a href=\"http://www.linkedin.com/company/kla-tencor/careers\">www.linkedin.com/company/kla-tencor/careers</a></p>",
      "how_to_apply": "<p><a href=\"http://careers.kla-tencor.com/\">http://careers.kla-tencor.com/</a></p>",
      "id": "82df55ee-645b-11e8-980b-7fb7acb86fa2",
      "location": "Milpitas, CA, United States",
      "title": "KLA-Tencor Senior Software Engineer (Java | Python | REST | Web Services)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/82df55ee-645b-11e8-980b-7fb7acb86fa2"
    },
    {
      "company": "Clip",
      "company_logo": "http://github-jobs.s3.amazonaws.com/0ce21d7a-6453-11e8-8a54-a5f67533e20c.jpg",
      "company_url": "https://clip.mx/",
      "created_at": "Wed May 30 21:50:17 UTC 2018",
      "description": "<p>Clip is changing the way payments work in Mexico! We are empowering people to exchange value directly from a mobile device. Clip enables anyone to accept card payments, at any time, and any where by turning your smartphone or tablet into a card terminal. We're a well funded quickly growing FinTech startup. We are the leaders in our market and are accelerating to extend our lead and move into new markets. Our mission: we allow people and businesses to exchange value and develop enduring relationships in a simple, fast, safe, socially relevant and more beautiful way. We are accomplishing our goals with our teams located in Mexico City, Mexico and Draper, Utah. We are the leaders in our market and are accelerating to extend our lead and move into new markets.</p>\n\n<p>The Senior Backend Engineer/Java Developer will be part of the team responsible for software and tools to support and implement PayClip’s core payment processing infrastructure.</p>\n\n<p>Key Activities:\n1. Work as part of a team developing in Java using Agile development methods\n2. Contribute to team and organizational improvements in process and infrastructure\n3. Work with the team and Chief Architect to design and build services for payment processing\n4. Effectively use tools and ingenuity to identify and fix defects before they become a problem\n5. Invent new things and create world-changing software!</p>\n\n<p>Education:\nEducation level required: B.S. Computer Science or equivalent experience\nMajor/Field of study: Computer Science or related field</p>\n\n<p>Technical knowledge required:</p>\n\n<ol>\n<li><p>Proficient in Java development and OO methodology, Agile development, design patterns, unit\ntesting, and other software engineering principles and processes</p></li>\n<li><p>Solid understanding of internet and IP communications protocols and formats such as TCP/IP,\nHTTP, XML, JSON, etc.</p></li>\n<li><p>Proficient in Linux/Unix and comfortable with Mac/Windows</p></li>\n<li><p>Knowledge of Spring Framework</p></li>\n<li><p>Solid understanding of RESTful service architecture and APIs</p></li>\n<li><p>We are looking for candidates who have 7+ years of experience in as a Backend engineer using Java</p></li>\n</ol><p>Skills and competences:</p>\n\n<ol>\n<li><p>Written and oral communication in\nEnglish / Spanish </p></li>\n<li><p>Linux/Unix administration and\nmanagement</p></li>\n<li><p>AWS/Cloud infrastructure</p></li>\n<li><p>IP network management, routing, security</p></li>\n<li><p>Process automation, configuration management</p></li>\n<li><p>Ability to work on a team, innovate, and LOVE technology</p></li>\n</ol><p>Experience:</p>\n\n<p>Java, software development, OOD, web services</p>",
      "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/payclipcom/view/P_AAAAAADAAADCoiyBt9yrya?trackingTag=github\">https://hire.withgoogle.com/public/jobs/payclipcom/view/P_AAAAAADAAADCoiyBt9yrya?trackingTag=github</a></p>",
      "id": "4e86e8fa-6453-11e8-8907-c8c4ad976e84",
      "location": "Mexico City, Mexico",
      "title": "Senior Backend Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/4e86e8fa-6453-11e8-8907-c8c4ad976e84"
    },
    {
      "company": "Omaze",
      "company_logo": "http://github-jobs.s3.amazonaws.com/1b521738-644f-11e8-8d9b-e888f3b1bd63.png",
      "company_url": null,
      "created_at": "Wed May 30 21:20:14 UTC 2018",
      "description": "<p>Who We Are: </p>\n\n<p>Omaze’s mission is to transform lives by leveraging the power of storytelling and technology. Our model democratizes traditional auction-giving by offering people everywhere the chance to have a once-in-a-lifetime experience for as little as a $10 donation. To continue raising money for hundreds of nonprofits around the world, we’re growing our team of smart, dedicated and passionate world changers! That’s where you come in.</p>\n\n<p>Who We're Seeking:</p>\n\n<p>Omaze's API team is looking for great engineering talent to help us grow in 2017, 2018 and beyond. We have interesting problems and big ambitions. We need outstanding people to help us build awesome stuff.</p>\n\n<p>A Senior Back-End Engineer at Omaze is someone special. You've got experience, but also wisdom; you're great technically, but also with people; you take pride in your craft, and also in the success of your teammates. You have high standards. You love to ship. And you're excited by the prospect of using your talents to meaningfully help other people.</p>\n\n<p>The successful candidate will be: </p>\n\n<ul>\n<li>Experienced. You have a deep understanding of how to architect and build scalable back-end systems that serve different clients; You’re comfortable with CI/CD, are pragmatic and a good critical thinker;</li>\n<li>Technical. You love building services and APIs using Python, and are a wizard at working with databases;</li>\n<li>Accountable. You are able to drive projects from inception to ship;</li>\n<li>Capable. You can write great code, and make others' code great;</li>\n<li>Natural Leader. You are the sort of person people want to work with. You have great ideas, sure, but people follow you because you make them (and Omaze) better.</li>\n</ul><p>Key Responsibilities: </p>\n\n<ul>\n<li>Architecture: Be a leader in proposing innovative designs to enhance our existing infrastructure and develop solutions to solve unique business issues.</li>\n<li>Feature Delivery: Write well designed, testable and reliable code as you ship features that help support amazing causes world-wide.</li>\n<li>Performance: Maintain a highly responsive system by ensuring code quality, stability and scalability.</li>\n<li>Team-Oriented: Lead, support and mentor fellow developers by providing advice, encouraging best practices and performing design and code reviews.</li>\n</ul><p>Our Ideal Candidate: </p>\n\n<ul>\n<li>You have a minimum of 7 years professional software experience</li>\n<li>You have experience with several programming languages, and deep knowledge of at least one object-oriented language</li>\n<li>You do (or would) enjoy working in Python</li>\n<li>You’ve got hands-on experience with e-commerce systems (designing, building, maintaining)</li>\n<li>You have experience with microservices (building, deploying, supporting)</li>\n<li>You have a willingness and ability to communicate ideas and lead/mentor other developers</li>\n<li>You have designed and implemented optimized, scalable architectures</li>\n<li>You have built and worked with RESTful APIs</li>\n<li>You are great at query optimization with relational (MySQL) and non-relational databases.</li>\n<li>You have experience with AWS technologies such as Lambda, RedShift, DynamoDB, and S3</li>\n<li>You have experience with RabbitMQ, Celery, Redis, and ElasticSearch</li>\n</ul><p>To Apply:</p>\n\n<p>Tell us a little bit about yourself and why you would be an ideal fit.</p>",
      "how_to_apply": "<p><a href=\"https://grnh.se/9d5833752\">https://grnh.se/9d5833752</a></p>",
      "id": "2bed7ac4-644f-11e8-8537-b918eaf201f7",
      "location": "Los Angeles",
      "title": "Lead Back-End Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/2bed7ac4-644f-11e8-8537-b918eaf201f7"
    },
    {
      "company": "RareCyte",
      "company_logo": "http://github-jobs.s3.amazonaws.com/9ad662d8-644b-11e8-99f7-892718159dc4.png",
      "company_url": "http://www.Rarecyte.com",
      "created_at": "Wed May 30 20:55:01 UTC 2018",
      "description": "<p>RareCyte is a well-funded life sciences company focused on the development of unique technology to detect and characterize rare cells in blood. Our technology platform has been adopted by leading research institutions and pharmaceutical companies worldwide for research and clinical programs.  The RareCyte platform has the potential to become the leading diagnostic tool in oncology, prenatal diagnostics, infectious disease, and immunology.  We are looking for a software engineer experienced in systems, hardware/software interfaces or instrument control to join our small, dynamic software and computational analysis team.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Primary systems software development role for new and existing RareCyte products</li>\n<li>Respond to evolving requirements while delivering quality software</li>\n<li>Contribute to all stages of the software lifecycle, including requirements, architecture, design, \n    coding, verification and maintenance</li>\n<li>Maintain current knowledge of competitive technologies as well as technical and biomedical \n    developments related to company products</li>\n</ul><p>Required Qualifications:</p>\n\n<ul>\n<li>B.S. in a relevant engineering or scientific discipline</li>\n<li>Strong C++ skills including C++11 or later absolutely essential</li>\n<li>Minimum three years developing production systems with C++ software </li>\n<li>Experience with software development for instrument control or hardware/software interfaces</li>\n<li>Experience writing and maintaining multi-threaded code</li>\n<li>Willingness and interest in acquiring broad domain knowledge of the RareCyte system</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to work well both independently and within a team</li>\n</ul><p>Preferred Qualifications:</p>\n\n<ul>\n<li>Experience with boost, boost.asio, Qt, OpenCV, Python</li>\n<li>Experience with test-driven development</li>\n<li>Experience with hardware testing / QA </li>\n<li>Experience with development under FDA or similar regulatory requirements</li>\n</ul>",
      "how_to_apply": "<p>Apply to this link:\n<a href=\"https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=9cacffaa-bfa0-4656-8dcf-ce9710f653c0&amp;jobId=185169&amp;lang=en_US&amp;source=CC2&amp;ccId=19000101_000001\">https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=9cacffaa-bfa0-4656-8dcf-ce9710f653c0&amp;jobId=185169&amp;lang=en_US&amp;source=CC2&amp;ccId=19000101_000001</a></p>",
      "id": "9ffc7b3a-644b-11e8-808b-eaf092ede81a",
      "location": "Seattle",
      "title": "Systems Software Instrument Control",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/9ffc7b3a-644b-11e8-808b-eaf092ede81a"
    },
    {
      "company": "PGA of America",
      "company_logo": "http://github-jobs.s3.amazonaws.com/2bb15ba8-6449-11e8-8df9-8aa93c73de7a.png",
      "company_url": "http://pga.org",
      "created_at": "Wed May 30 20:40:56 UTC 2018",
      "description": "<p>PGA of America is looking for a Senior Node.js Backend Engineer.  The engineer will be working in a team to connect a new Graphql API to different front-end clients and external partners.  They will also work to build out a middleware layer that will connect multiple internal and external systems together as data/state changes.  We are working in an AWS Serverless architecture, so hands-on experience is required.  The engineer is expected to participate in standup calls and slack conversations during Eastern business hours.  The engineer will participate in code reviews and collaborate with other engineers with varying levels of experience.  The engineer should have a natural inclination to testing and hopefully subscribes to TDD. </p>\n\n<p>Position Type: Temp/Contract to hire.  Full-time. \nLocation: Our headquarters office is located in Palm Beach Gardens, Florida. South Florida candidates preferred.  Remote with stipulations. </p>\n\n<p>JOB SUMMARY:</p>\n\n<p>Design, develop, test, deploy, maintain, and improve software and system of the Association.</p>\n\n<p>RESPONSIBILITIES (Specific areas of responsibility include but are not limited to):</p>\n\n<p>Design, develop, test, deploy, maintain and improve software.</p>\n\n<p>Manage individual projects priorities, deadlines and deliverables.</p>\n\n<p>Help build a world-class team and cultivate innovation.\nLead designs of major software components, systems, and features.</p>\n\n<p>Mentor and train other team members on new technologies, design techniques, and coding standards.</p>\n\n<p>Actively seek out customer and market insights that lead to high-value digital products.</p>\n\n<p>EDUCATION AND EXPERIENCE:</p>\n\n<p>Bachelor's Degree (B.A.) in Computer Programming, Computer Science or related field.  Master's degree, further education or experience in engineering, computer science or other technical related field preferred. </p>\n\n<p>Seven years of experience working with two or more of the following: web application development, databases, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, networking, and/or developing large software systems.  Software development experience in one or more general-purpose programming languages including but not limited to: C/C++, C#, Python, JavaScript, Go, Objective-C, Swift.  Advanced design, problem solving, and troubleshooting skills.  Active contributor and thought leader in the broader technology industry.</p>\n\n<p>Prefer experience with one or more from the following: DevOps, automation, Machine Learning, Mobile Application Development, Front End Development, Security and Privacy.  Interest and ability to learn other coding languages as needed. </p>\n\n<p>Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions of this position.</p>\n\n<p>The PGA of America is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law. DFWP.</p>",
      "how_to_apply": "<p>Please apply online via <a href=\"http://careers.pgahq.com\">http://careers.pgahq.com</a></p>",
      "id": "347c8f28-6449-11e8-98ab-d53d5e9d49fd",
      "location": "Palm Beach Gardens, Florida",
      "title": "Senior Node Developer (Software Engineer)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/347c8f28-6449-11e8-98ab-d53d5e9d49fd"
    },
    {
      "company": "CourseHorse",
      "company_logo": "http://github-jobs.s3.amazonaws.com/0260c4a0-6430-11e8-9cf6-ec24662f1db0.png",
      "company_url": "http://coursehorse.com",
      "created_at": "Wed May 30 17:39:29 UTC 2018",
      "description": "<p><b>About Us<b></b></b></p>\n\n<p>Based in downtown NYC, CourseHorse is the first marketplace that helps people discover &amp; enroll in trusted local classes, ranging from casual programs like cooking &amp; art, to professional courses like finance and programming. We believe that learning is the single greatest way to positively impact individuals &amp; our society, which makes our goal simple: to make lifelong learning easier.</p>\n\n<p>We work with over 2,200 class providers offering 60,000 classes, we've recently launched a nationwide partnership with Groupon, and we're seeking passionate, talented team members to get in on the ground floor &amp; help steer us to the stars.</p>\n\n<p><b>Job Description<b></b></b></p>\n\n<p>CourseHorse is seeking an extremely talented engineer to help own the full software lifecycle including planning, implementation, and deployment. As a critical member of our small team, you will tackle the complex challenges of scaling architecture while also defining development methodologies and best practices. Our ideal candidate loves to code and build technology that improves peoples' lives.</p>\n\n<p><b>Responsibilities<b></b></b></p>\n\n<ul>\n<li>Build and iterate on product features for our students, schools, and admins, analyzing system and business metrics post-release</li>\n<li>Jump between our various stacks and languages and contribute high quality, well-architected code (we write in Ruby, Elixir, PHP, Golang, Javascript)</li>\n<li>You'll be passionate about learning new technologies (and then teaching us about them!)</li>\n<li>Act as a mentor to fellow engineers through code reviews, design document critiques, and brainstorms throughout the software development process</li>\n<li>Collaborate with product managers, designers, and business teams to identify and execute best solutions, focusing on business impact, product polish, and code quality</li>\n<li>Participate in sprint planning, standups and retrospective meetings</li>\n<li>Proactively identifies opportunities to improve code, engineering processes, and systems with effective solutions</li>\n<li>Own the lifecycle of tickets on your plate, from planning to launch, including implementation, testing and measuring</li>\n</ul><p><b>Experience<b></b></b></p>\n\n<ul>\n<li>3+ years of full stack software engineering</li>\n<li>Experience with at least one (ideally many) web-application framework (we use Phoenix, Rails, Zend, Cake, and Express)</li>\n<li>Experience with at least one dynamic back end language (having worked with static and/or functional programming is cool too)</li>\n<li>Experience implementing responsive designs with HTML and CSS</li>\n<li>Experience using various database systems (we use MySQL and Redis, mostly)</li>\n<li>You have a bias towards action and jump into situations eager to make things better</li>\n<li>You're a strong communicator and can explain complex technical concepts to designers, support teams, and other stakeholders</li>\n<li>You're authorized to work for any employer in the U.S.</li>\n<li>Nice to have: Experience working with search engine technologies (Solr, Lucene, CloudSearch, or ElasticSearch a plus)</li>\n<li>Nice to have: You’ve scaled cloud based infrastructure and deployment automation (AWS / Elastic Beanstalk a plus)</li>\n</ul><p><b>How to know if CourseHorse is a good fit:<b></b></b></p>\n\n<ul>\n<li>You’re looking for more than just a job – you have a desire to help build something real</li>\n<li>You want to get in at the beginning, build from the ground up</li>\n<li>You want ownership over what you produce</li>\n<li>You’re naturally curious and love learning</li>\n<li>You’re willing to help out as needed, regardless of role or title </li>\n<li>You like to move fast and are comfortable with failure</li>\n<li>You enjoy and know how to get stuff done in a rapidly changing environment</li>\n<li>You want to be friends with the people you work with</li>\n<li>You like fun (sometimes fabulously witty) environments, and want to work in downtown NYC</li>\n</ul><p><b>Compensation / Perks<b></b></b></p>\n\n<ul>\n<li>Competitive salary &amp; stock options</li>\n<li>Monthly class scholarship</li>\n<li>Powerful hardware/software support</li>\n<li>Flexible vacation (and yes, we all actually use it!)</li>\n</ul><p>Please include answers to the following questions in your cover letter:</p>\n\n<p>You have just released a major feature to the website; shortly after the deploy completes you get a message from the CEO saying the site is down. You visit the frontpage and get a 500 error. Uh oh. What questions would you begin to ask? How would you begin to handle the issue to find out where the failure is happening? You don't have to go in depth, just give us an idea of how you would respond to this issue and some top areas you'd start looking (or the questions you'd start asking).</p>\n\n<p>Please include a link to your favorite animated gif</p>",
      "how_to_apply": "<p><a href=\"https://coursehorse.applytojob.com/apply/CKHgJiNmQU/Director-Of-Business-Development?source=github\">https://coursehorse.applytojob.com/apply/CKHgJiNmQU/Director-Of-Business-Development?source=github</a></p>",
      "id": "519ba67a-6430-11e8-9dbf-4c496c3e122c",
      "location": "New York, NY",
      "title": "Full Stack Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/519ba67a-6430-11e8-9dbf-4c496c3e122c"
    },
    {
      "company": "SRS Investment Management",
      "company_logo": null,
      "company_url": null,
      "created_at": "Wed May 30 15:23:56 UTC 2018",
      "description": "<p>What’s the Job?</p>\n\n<p>You’ll be joining our data science team as a Data Product Engineer. You’ll be responsible for testing, monitoring, and improving the data collection programs we have in production, as well as developing new software to capture data from the web and extract insights from third-party sources. You’ll be writing Python scripts deployed on AWS, and communicating with data scientists and infrastructure engineers.</p>\n\n<p>Required:</p>\n\n<ul>\n<li>5+ Years professional experience with Python</li>\n<li>Python data structures and best practices</li>\n<li>AWS and Linux (Ubuntu/CentOS) , Bash scripting</li>\n<li>Professional experience with a SQL-based database, such as MySQL</li>\n<li>Writes organized code with appropriate exception handling and logging</li>\n<li>Understanding of HTTP network requests and responses</li>\n<li>Understanding of HTML and JSON formats</li>\n<li>Ability to write technical documentation and comment code</li>\n<li>Ability to write test suites and set up automation environments</li>\n</ul><p>Plusses:</p>\n\n<ul>\n<li>Experience with scrapy, beautiful soup, requests, selenium</li>\n<li>Amazon Redshift/ Hadoop</li>\n<li>Prior experience as a front-end, back-end, or full-stack web developer</li>\n<li>Javascript / NodeJS</li>\n<li>Python Django/Flask</li>\n</ul>",
      "how_to_apply": "<p>Please email your resume to <a href=\"mailto:careers@srsfund.com\">careers@srsfund.com</a></p>",
      "id": "1d212f0e-641d-11e8-8afa-9c874a0d3a55",
      "location": "New York City",
      "title": "Python Data Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/1d212f0e-641d-11e8-8afa-9c874a0d3a55"
    },
    {
      "company": "Authentic Digital Agency",
      "company_logo": "http://github-jobs.s3.amazonaws.com/db2426ae-5ece-11e8-870e-698d39efd139.png",
      "company_url": "https://beauthentic.digital/",
      "created_at": "Tue May 29 21:43:47 UTC 2018",
      "description": "<p>The Architect will be part of the Technical Delivery Team and will be responsible for delivering quality scalable solutions for clients in the digital marketing space.  We are headquartered in Richmond, VA but we are open to this position being remote.</p>\n\n<p>The environment is fast-paced and the goals are demanding, Architects are expected to quickly become experts in various digital media platforms. Our ideal candidate is creative, energetic, deeply knowledgeable about the latest technologies, and has a passion for technology and software development. In addition, the ideal candidate is comfortable meeting and presenting in front of clients and executive level stakeholders. The candidate must possess the ability to share and communicate ideas clearly, both orally and in writing, to business sponsors and partners, technical resources, and executives, in clear concise language that is the effect for each respective group.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Work with a team to design and implement software engineering solutions</li>\n<li>Analyze and optimize application code for efficiency, reliability and performance</li>\n<li>Create and maintain design and other technical documentations and artifacts.</li>\n<li>Manage multiple competing priorities/projects in a fast-paced deadline-oriented environment</li>\n<li>Embrace a highly collaborative team that rewards quality code and effective communication</li>\n<li>Stay current with the latest development best practices</li>\n<li>Write efficient, reliable, and maintainable code whether implementing architectural improvements, user-facing features, or fixing bugs</li>\n<li>Translate complex functional, technical, and business requirements into architectural solutions and designs.</li>\n<li>Troubleshoot and resolve issues, problems, and errors encountered across our various platforms</li>\n<li>Has depth and breadth of knowledge across multiple software engineering disciplines</li>\n<li>Is self-driven, actively looks for ways to contribute, and knows how to get things done</li>\n<li>Has a strong sense of engineering craftsmanship, takes pride in the code they write</li>\n<li>Believes that good software development includes good testing, documentation, and collaboration</li>\n<li>Has good communication and reasoning skills, including the ability to make a strong case for technology choices</li>\n<li>Has ability to build consensus and iteratively improve solution</li>\n</ul><p>Basic Qualifications:</p>\n\n<ul>\n<li>Experience using Enterprise CMS, such as Hippo, Jahia, SiteCore, Adobe</li>\n<li>Experience with enterprise Java and open source technologies (C#, Go, etc.)</li>\n<li>Experience writing  Angular/React JS applications</li>\n<li>Expert in building software to deliver websites and web applications; through understanding of web technologies (Http, edge caching, HTML/CSS)</li>\n<li>Demonstrated ability in developing enterprise applications</li>\n<li>Ability to collaborate in a small, productive development team as well as ability to work independently</li>\n<li>Proficient with all aspects of the Software Development Lifecycle</li>\n<li>Motivated self-starter with the ability to learn and adapt to new technologies</li>\n<li>Excellent verbal and written communication skills; can effectively articulate complex ideas and influence others through well-reasoned explanations</li>\n<li>Experience with any of the following technologies and concepts is a plus :</li>\n<li>Open sources frameworks and tools such as Spring, Solr, ElasticSearch, Kafka, Hystrix, etc.</li>\n<li>Experience with Docker</li>\n<li>Cloud-based technologies (AWS, EC2, S3, SQS, Kinesis, DynamoDB)</li>\n<li>NoSQL databases such as MongoDB and Cassandra</li>\n<li>Automated testing frameworks like JUnit, Mockito, Cucumber and Gherkin</li>\n<li>Continuous integration tools such as Jenkins</li>\n<li>Understanding of Java web services and Microservice Architectures and design patterns</li>\n<li>Familiarity with core design patterns</li>\n</ul><p>Preferred Qualifications:</p>\n\n<ul>\n<li>5+ years of experience in agile development and methodologies and buiding web applications.</li>\n<li>4+ years of experience in Java, Node, Go or a combination</li>\n<li>2+ years of experience building consumer-facing web and mobile software solutions at scale with CMS</li>\n</ul><p>Preferred Education:\nBS or MS in Computer Science or related field or equivalent work experience.</p>\n\n<p>*We are open to the position being remote.</p>",
      "how_to_apply": "<p>Send your resume directly to <a href=\"mailto:careers@beauthentic.digital\">careers@beauthentic.digital</a></p>",
      "id": "02f71392-6381-11e8-8796-b3f44feed131",
      "location": "Richmond, Va",
      "title": "Java Architect",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/02f71392-6381-11e8-8796-b3f44feed131"
    },
    {
      "company": "Jane Street",
      "company_logo": "http://github-jobs.s3.amazonaws.com/dba43940-0b39-11e3-83c2-8c287f4c9d67.jpeg",
      "company_url": "http://Jane Street",
      "created_at": "Tue May 29 15:02:35 UTC 2018",
      "description": "<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p>\n\n<p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p>\n\n<p>As Jane Street grows, the quality of the development tools we use matters more and more.  We increasingly work on the OCaml compiler itself: adding useful language features, fine-tuning the type system and improving the performance of the generated code. Alongside this, we also work on the surrounding toolchain, developing new tools for profiling, debugging, documentation and build automation.</p>\n\n<p>We're looking to hire a developer with experience working on compilers to join us. That experience might be from working on a production compiler in industry or from working on research compilers in an academic setting. No previous experience with OCaml or functional programming languages is required.</p>\n\n<p>We’re looking for candidates for both our London and New York offices. Benefits and compensation are highly competitive.</p>",
      "how_to_apply": "<p><a href=\"https://www.janestreet.com/join-jane-street/apply/\">https://www.janestreet.com/join-jane-street/apply/</a></p>",
      "id": "9e8ba450-e72e-11e7-926f-6ce07b7015c8",
      "location": "New York & London",
      "title": "Compiler Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/9e8ba450-e72e-11e7-926f-6ce07b7015c8"
    },
    {
      "company": "Jane Street",
      "company_logo": "http://github-jobs.s3.amazonaws.com/dba43940-0b39-11e3-83c2-8c287f4c9d67.jpeg",
      "company_url": "http://janestreet.com",
      "created_at": "Tue May 29 15:01:52 UTC 2018",
      "description": "<p>Software Developer </p>\n\n<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p>\n\n<p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p>\n\n<p>We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.</p>\n\n<p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.</p>\n\n<p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href=\"http://ocaml.janestreet.com/?q=node/61\">http://ocaml.janestreet.com/?q=node/61</a>), and our programming blog (<a href=\"http://ocaml.janestreet.com\">http://ocaml.janestreet.com</a>).</p>\n\n<p>We also have extensive benefits, including:</p>\n\n<ul>\n<li>90% book reimbursement for work-related books</li>\n<li>90% tuition reimbursement for continuing education</li>\n<li>Excellent, zero-premium medical and dental insurance</li>\n<li>Free lunch delivered daily from a selection of restaurants</li>\n<li>Catered breakfasts and fresh brewed Peet's coffee</li>\n<li>An on-site, private gym in New York with towel service</li>\n<li>Kitchens fully stocked with a variety of snack choices</li>\n<li>Full company 401(k) match up to 6% of salary, vests immediately</li>\n</ul><p>More information at <a href=\"http://janestreet.com/culture/benefits/\">http://janestreet.com/culture/benefits/</a></p>",
      "how_to_apply": "<p>Please apply through our web app form at  <a href=\"https://www.janestreet.com/join-jane-street/apply/\">https://www.janestreet.com/join-jane-street/apply/</a></p>",
      "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
      "location": "New York, NY; London, UK; Hong Kong",
      "title": "Software Developer (Functional Programming)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45"
    },
    {
      "company": "FullStack",
      "company_logo": "http://github-jobs.s3.amazonaws.com/dff1bf88-6348-11e8-826e-9293987c3ee3.png",
      "company_url": null,
      "created_at": "Tue May 29 14:04:44 UTC 2018",
      "description": "<p>We need an experienced, passionate, and motivated React Native engineer who can jump in and take ownership of our challenging mobile engineering projects. Our native mobile products interact deeply with RESTful API backends, so knowledge of web application architectures and technologies is a plus</p>\n\n<p><strong>Primary Responsibilities</strong></p>\n\n<ul>\n<li>Drive the holistic development of our mobile projects, from architecture, to coding,  to deployment.</li>\n<li>Build mobile applications using React Native + Redux</li>\n<li>Ownership in developing and improving all aspects of our stack (development, testing, CI, automation, and architecture)</li>\n<li>Deploy to both iOS and Android (Apple App Store, Google Play Store)</li>\n<li>Writing functional, well-tested code</li>\n<li>App layout and user interface development</li>\n<li>Designing and engineering features that deliver value to the people who use them. This means collaborating closely with the entire team (designers, product managers, etc.) </li>\n<li>Refactoring, paying down technical debt, etc.</li>\n</ul><p><strong>About FullStack</strong>\nOur mission is to make our clients incredibly successful by developing and improving ideas into highly functional and usable web applications. Our team has become renowned in our ability to bring creativity, expertise, and sound development practices to notable and ambitious startups. Our development work focuses on architecting and building new applications as well as scaling existing apps for our clients as they grow.</p>\n\n<p><strong>Let’s Have A Chat If You…</strong></p>\n\n<ul>\n<li>Have developed React Native apps that communicate with Restful APIs, use local storage, network data synchronization, and user authentication. </li>\n<li>Enjoy working with React Native and have a successful track record of developing both iOS and Android applications using this framework.</li>\n<li>Love programming with ES6 syntax.</li>\n<li>Have integrated with native hardware components in a React Native app.</li>\n<li>Understand and have experience making decisions about mobile application architecture, including data modeling, networking and data synchronization, and concurrency.</li>\n<li>Are competent with developing application interfaces for multiple device types based off of mockups.</li>\n<li>Strive to automate everything you do - from sending out builds to running tests. </li>\n<li>Are equally comfortable working with HTTP-based web services, and have a working knowledge of web application and API architectures.</li>\n<li>Have an appreciation for the peace of mind that comes with well-tested, documented code.</li>\n<li>Are excited by the web and keep up with new technologies and that excitement is infectious.</li>\n<li>Communicate well with others in both written and verbal forms</li>\n<li>Are self-directed and able to manage your time effectively</li>\n</ul><p><strong>Bonus points for…</strong></p>\n\n<ul>\n<li>iOS or Android development experience using Objective-C, Swift, or Android</li>\n<li>Ruby on Rails development experience. </li>\n<li>Knowing your way around XCode or Android Studio</li>\n<li>Familiarity using Expo to build React Native apps</li>\n<li>Experience working with an agile / scrum-based development model</li>\n<li>A BS or MS in Computer Science or, Math or another analytic discipline</li>\n<li>Previous history of working with a remote, distributed team</li>\n<li>Significant contributions to or ownership of open source projects (please do tell!)</li>\n</ul><p><strong>Other information about this position</strong></p>\n\n<ul>\n<li>Working remotely is how we operate</li>\n<li>This is a contract position, with up to 40 hours per week</li>\n<li>Work visa transfer or sponsorship is not possible at this time</li>\n<li>We are looking for people located within the continental United States</li>\n</ul>",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@gofullstack.com\">jobs@gofullstack.com</a></p>",
      "id": "e69e5a1c-6348-11e8-952a-a8b748776d98",
      "location": "Anywhere USA ",
      "title": "React Native Engineer",
      "type": "Contract",
      "url": "http://jobs.github.com/positions/e69e5a1c-6348-11e8-952a-a8b748776d98"
    },
    {
      "company": "Schoonderbeek Elektronica Systemen B.V.",
      "company_logo": "http://github-jobs.s3.amazonaws.com/bbe60558-6326-11e8-9815-52449d34d69a.JPG",
      "company_url": "http://www.schoonderbeek.biz/",
      "created_at": "Tue May 29 09:58:33 UTC 2018",
      "description": "<p><strong>Ben jij als C# Ontwikkelaar toe aan verbreding én verdieping van je werk en meer betrokkenheid bij het eindproduct? Bekijk dan onderstaande vacature.</strong><br><br>\nSchoonderbeek Elektronica Systemen B.V. te <strong>Nieuw-Vennep</strong> ontwikkelt, produceert en onderhoudt geavanceerde monitorings- en bewakingssystemen voor in de zorg. De groeiende markt en de vraag naar innovatie in onze producten zorgen ervoor dat we behoefte hebben aan meer ontwikkelaars.<br><br>\nDaarom is Schoonderbeek Elektronica Systemen op zoek naar een ervaren:<br><strong>C# .NET Software Engineer</strong><br><br><strong>Wat ga je doen als C#.NET Software Engineer?</strong><br>\nAls C# .NET Software Ontwikkelaar bouw je mee aan geavanceerde monitorings- en bewakingssystemen voor patiënten. Samen met het Ontwikkelteam denk je mee aan en ontwerp en ontwikkel je onder andere:</p>\n\n<ul>\n<li>software voor nieuwe producten;</li>\n    <li>uitbreidingen en verbeteringen aan bestaande producten.</li>\n</ul><p><br>\nHet team is klein, maar hecht en schuwt de technische discussie op de werkvloer niet. De bereidheid om elkaar te helpen in het team is groot én je wordt niet afgerekend op je fouten. Met een houding van 'niet kijken naar de problemen, maar zoeken naar de (beste) oplossingen' wordt in het team gewerkt.<br><br>\nAls C# .NET Software Developer bij Schoonderbeek werk je aan de hele productlijn bij een organisatie waar innovatie centraal staat. Hier wordt niet alleen gepraat over de allernieuwste technologieën, maar ze worden ook echt toegepast. Uniek is ook dat het hele traject binnenshuis plaatsvindt. Van idee via ontwikkeling tot en met de productie en de nazorg/service. En als onze nieuwe C# .NET Software Engineer ben jij bij het hele traject betrokken.<br><br><strong>Jouw eigenschappen:</strong></p>\n\n<ul>\n<li>\n<strong>Meerjarige ervaring</strong> als <strong>softwareontwikkelaar</strong>.</li>\n    <li>Kennis van en ervaring met .<strong>NET</strong> en <strong>C#</strong>.</li>\n    <li>Minimaal <strong>hbo</strong>-<strong>denk</strong>- en -<strong>werkniveau</strong>.</li>\n    <li>Groot kwaliteitsbewustzijn.</li>\n    <li>Je bent leergierig en hebt de ambitie je vakkennis te vergroten.</li>\n</ul><p><br><strong>Onze producten</strong><br>\nOnze elektronische zorgsystemen bewaken het welzijn van cliënten en verzorgen de afhandeling van een (alarm)oproep naar het verzorgend personeel, zodat een klant of patiënt snel kan worden geholpen. Deze systemen worden via een vast dealernetwerk ingezet op een breed vlak in de gezondheidsmarkt (ziekenhuizen, psychiatrische instellingen, verpleeg- en verzorgingshuizen) voor communicatie, signalering, informatie, alarmering en beveiliging.<br><br><strong>Arbeidsvoorwaarden</strong><br>\nHet salaris is in overeenstemming met de functie, afhankelijk van leeftijd, opleiding en ervaring. We starten met een jaarcontract. Maar de bedoeling is om dit zo snel mogelijk om te zetten naar een vast dienstverband. Wij willen graag jaren met jou samenwerken aan de ontwikkeling van onze producten. Schoonderbeek heeft flexibele werktijden tussen de 32 en max. 38 uur per week.<br><br><strong>Informatie en/of sollicitatie</strong><br>\nHiervoor neem je rechtstreeks contact op met Dick Brons, via telefoonnummer 06-34819201 en/of via e-mail <a href=\"mailto:dwb@bronsconsulting.nl\"><strong><a href=\"mailto:dwb@bronsconsulting.nl\">dwb@bronsconsulting.nl</a></strong></a>. Kijk op <a href=\"https://ltpx.nl/acCoZJy\" target=\"_blank\"><strong>schoonderbeek.biz</strong></a> voor meer informatie over onze organisatie.<br><br>\nSolliciteren kan ook via het <a href=\"https://ltpx.nl/hxBYVp4\" target=\"_blank\"><strong>online sollicitatieformulier</strong></a>. <br><br><em>Acquisitie naar aanleiding van deze vacature wordt op prijs gesteld.</em><img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=47195\"></p>",
      "how_to_apply": "<p><a href=\"https://ltpx.nl/9USWBxg\" target=\"_self\">Klik hier om te solliciteren</a></p>",
      "id": "c06b8b3e-6326-11e8-8b5a-2a9752e0635b",
      "location": "Nieuw-Vennep",
      "title": "C# .NET Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/c06b8b3e-6326-11e8-8b5a-2a9752e0635b"
    },
    {
      "company": "Homestars Inc",
      "company_logo": "http://github-jobs.s3.amazonaws.com/ad82e758-62a2-11e8-99d2-cf03b470d2fa.png",
      "company_url": "https://homestars.com",
      "created_at": "Mon May 28 18:34:37 UTC 2018",
      "description": "<h3>Description</h3>\n\n<p>WHO WE ARE: \nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars is part of ANGI Homeservices, the World’s Home Improvement Leader.</p>\n\n<h3>WHY JOIN US:</h3>\n\n<p>HomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be part of something great, work on a dynamic and growing team, we want to hear from you. \nPerks of working at HomeStars: </p>\n\n<ul>\n<li>We are growing fast. HomeStars has made the Profit 500 list five years running! </li>\n<li>Excellent Benefits Package. We want a healthy and happy team. </li>\n<li>Annual two-day, company wide off-site. </li>\n<li>December Break. The office is closed the week before New Year’s. </li>\n<li>Personal Growth. We seek to provide employees with constructive feedback to foster their career growth. </li>\n<li>Ping Pong Table, darts and yes foosball. De-Stress and make money in one space.</li>\n</ul><h3>ABOUT THE ROLE</h3>\n\n<p>Reporting to the CTO, you will be in charge of managing front-end resources for HomeStars, selecting technologies for new features, and supporting the front-end team in planning and execution of new features. \nOur Stack: </p>\n\n<ul>\n<li>Front End: ReactJS with Redux-Sagas, Babel, Browserify, Scss </li>\n<li>Backend: Ruby on Rails, NodeJs </li>\n<li>Database: MySQL \nWhat you’ll be doing: </li>\n<li>Participate in planning, estimating and monitoring web development activities </li>\n<li>Design, develop, test, deploy and maintain code </li>\n<li>Provide expert opinion on best practices for the front end, improve development processes, </li>\n<li>CI, tools and automation</li>\n</ul><h3>REQUIREMENTS</h3>\n\n<ul>\n<li>You have: Bachelor's degree in Computer Science/Computer Engineering, related field or equivalent training, fellowship, or work experience. </li>\n<li>4+ years development experience In-depth knowledge of design patterns and industry best practices </li>\n<li>Strong knowledge of ES6, HTML5, and CSS3. </li>\n<li>Strong knowledge of React and Redux (or equivalent) </li>\n<li>Strong familiarity with client/server integration (REST, WebSockets) </li>\n<li>Strong written and verbal communication skills </li>\n<li>Experience managing/leading teams </li>\n<li>Experience with Test Driven Development (Jest, Enzyme) </li>\n<li>An eye for design and UX</li>\n</ul><h3>YOU SHOULD BE ABLE TO</h3>\n\n<ul>\n<li>Identify needs and problems and proactively drive to solutions </li>\n<li>Work collaboratively with a variety of individuals and teams including design </li>\n<li>Work autonomously </li>\n<li>Write great documentation </li>\n<li>Foster a culture of exploration and growth in the team</li>\n</ul><h3>IT WOULD BE GREAT IF YOU HAD</h3>\n\n<ul>\n<li>Experience with Ruby on Rails or other REST frameworks </li>\n<li>Experience with Debian or other distro </li>\n<li>Experience with Webpack, Browserify, Babel and Node </li>\n<li>Experience with Git</li>\n</ul><p>We are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>",
      "how_to_apply": "<p><a href=\"mailto:careers@homestars.com\">careers@homestars.com</a></p>",
      "id": "b75324a0-62a2-11e8-8c41-c7f6743436f8",
      "location": "Toronto, Canada",
      "title": "Senior Front End Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/b75324a0-62a2-11e8-8c41-c7f6743436f8"
    },
    {
      "company": "Covidence",
      "company_logo": "http://github-jobs.s3.amazonaws.com/df4a6354-623b-11e8-8b87-ffc6091ff35a.png",
      "company_url": "https://www.covidence.org",
      "created_at": "Mon May 28 05:58:47 UTC 2018",
      "description": "<p><strong>Role:</strong> Mid-to-senior front-end/full-stack web developer, with Rails experience<br><strong>Industry:</strong> science, research, health<br><strong>Company:</strong> \n<strong>Technologies used:</strong> Ruby on Rails, Postgres, Heroku, AWS, Buildkite, Elasticsearch, GraphQL, Javascript (ES6), React, Webpack</p>\n\n<p>Covidence is looking for a web application developer to join our Melbourne-based team, locally or remotely. Our engineering ethos is to build software that is easy to maintain and scale with a small team from simple, functional components. You'll be a key contributor to the product and will have a voice in the organisation as a whole.</p>\n\n<p>The work you do will have meaningful impact in the world, improving health and well-being by enabling and supporting the use of evidence-based research and practice. Researchers worldwide use our SaaS product to distill the deluge of research findings into effective practices in health, education and other fields of human well-being.</p>\n\n<p>We are a small and young non-profit company, still building the foundation for a sustainable future and a great company culture. New additions to the team are welcome to help shape the company and culture with us around our shared values: honesty, compassion, curiosity, and diligence.</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>You will contribute to the product and product development processes.</li>\n<li>You will participate in wider company discussions and decisions.</li>\n<li>You will take features and bug fixes from concept through to production. You will sniff out the real requirements, understand design trade offs, deploy it to production, and monitor it with metrics.</li>\n<li>You will promote a safe and sustainable working environment.</li>\n<li>You will collaborate within the company and with our partners.</li>\n<li>You will treat our customers, partners, and colleagues with respect and compassion.</li>\n<li>You may occasionally need to respond to system outages after hours, but we will go to lengths to make this a rarity.</li>\n</ul><h2>Desired Skills</h2>\n\n<p>Many of these should describe you but we welcome applications from candidates who feel they can contribute in other ways.</p>\n\n<ul>\n<li>You are experienced using JavaScript and some JS framework, such as React, Ember, Angular, or Backbone.</li>\n<li>You are comfortable working in the context of Ruby on Rails applications.</li>\n<li>You can give thoughtful code review feedback and willing to receive the same.</li>\n<li>You are comfortable working through legacy code and refactoring it to be in accordance with team practices.</li>\n<li>You have working knowledge of at least one other programming language; you can convince us of its utility, but caution us where it might be painful.</li>\n<li>You have production experience maintaining a medium to large codebase.</li>\n</ul><h2>Some of the things we are working on</h2>\n\n<ul>\n<li>Integrating machine assistance into user workflows</li>\n<li>Building features to detect duplicate user data</li>\n<li>Importing and exporting user projects to partner APIs</li>\n<li>Formulating data models for capturing research and study findings</li>\n<li>Enterprise features such as Single Sign-On</li>\n<li>Converting the application from a conventional REST app to a React-based front-end using GraphQL.</li>\n</ul><h2>Perks</h2>\n\n<ul>\n<li> Laptop, monitor, and other equipment provided</li>\n<li>⚖️ Transparent and sustainable working environment</li>\n<li>⛱ Flexible working location and hours</li>\n<li> $2,000 AUD per year budget for professional development such as conferences or learning materials</li>\n<li> Not-for-profit salary packaging concessions (salary sacrifice your rent/mortgage!)</li>\n<li> We value continually improving our code quality and reducing technical complexity</li>\n<li> We inform our product changes with user testing and research</li>\n<li> We build software to encourage health practices supported by data, and we aim to build that software using practices and through decisions supported by data</li>\n<li>‍ Opportunities to collaborate with experts in machine learning, medical research, and other fields</li>\n<li> Regular 1-on-1s with manager</li>\n</ul>",
      "how_to_apply": "<p>Apply by emailing <a href=\"mailto:jobs@covidence.org\"></a><a href=\"mailto:jobs@covidence.org\">jobs@covidence.org</a>.</p>\n\n<p>Introduce yourself and your work however you feel best represents yourself. This could be a link to your past work or GitHub profile, a resume, or some links to blog posts you've written.</p>\n\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
      "id": "e93c532c-623b-11e8-9864-856315b7cfba",
      "location": "Melbourne, Australia",
      "title": "Front-end / Full-stack Web Developer (Ruby on Rails)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/e93c532c-623b-11e8-9864-856315b7cfba"
    },
    {
      "company": "MBTA",
      "company_logo": "http://github-jobs.s3.amazonaws.com/fc833688-39c5-11e8-85f3-f49a9f74bae0.png",
      "company_url": "http:// https://www.mbta.com/",
      "created_at": "Fri May 25 18:12:21 UTC 2018",
      "description": "<p><strong>SOFTWARE</strong> <strong>ENGINEER</strong> - Customer Technology Engineering</p>\n\n<p>The MBTA Customer Technology team is working to transform how people get around the Boston area. We’re a small but mighty team of designers, engineers and content specialists charged with bringing novel ideas, modern standards and a user-centered approach to technology on the T. As the MBTA works to reinvent itself, we have a rare opportunity to shape the future of transportation for Boston and communities all around Eastern Massachusetts, as well as blaze a trail for other transit agencies around the country. We’re always looking for people to join the team who are passionate about improving the daily transportation experience for our 400 million annual riders. Does this sound like you? Then please read on.</p>\n\n<p>The MBTA's Customer Technology team is looking for talented software engineers to help us build the technologies and platforms that will deliver a better customer experience for our riders, as well as deliver operational efficiencies for the organization. Our projects are varied, challenging, and most recently have included the redesign of the MBTA's website (see our work in progress here: <a href=\"https://www.mbta.com\">https://www.mbta.com</a>). If you’ve ever wondered what it would be like to work in a startup culture within a 60 year old government agency, and want the MBTA to be a modern transportation service with 21st century software, please apply.</p>\n\n<p><strong>We</strong> <strong>want</strong> <strong>to</strong> <strong>hear</strong> <strong>from</strong> <strong>you</strong> <strong>if</strong>:</p>\n\n<ul>\n<li><p>You have web development experience, ideally in Elixir and Phoenix.</p></li>\n<li><p>You live for tight data structures.</p></li>\n<li><p>You're a feature oriented developer.</p></li>\n<li><p>You hate it when automated tests fail, but hate it even more when the test coverage is lacking.</p></li>\n<li><p>You love UX and hate bad design.</p></li>\n<li><p>You're focused on DevOps and live to accumulate 9s.</p></li>\n</ul><p><strong>We'd</strong> <strong>be</strong> <strong>especially</strong> <strong>excited</strong> <strong>if</strong>:</p>\n\n<ul>\n<li>You've worked in the mobility/transportation space before.</li>\n</ul>",
      "how_to_apply": "<p>Apply here: <a href=\"https://jobs.lever.co/mbta\">https://jobs.lever.co/mbta</a></p>",
      "id": "0cf772a4-39c6-11e8-87d0-741f957bf29a",
      "location": "Boston, MA",
      "title": "SOFTWARE ENGINEER - Customer Technology Engineering",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/0cf772a4-39c6-11e8-87d0-741f957bf29a"
    },
    {
      "company": "Braintree Payments",
      "company_logo": "http://github-jobs.s3.amazonaws.com/2bc56ea8-602b-11e8-952e-c2edfdc422f5.jpg",
      "company_url": "https://www.braintreepayments.com/",
      "created_at": "Fri May 25 14:55:55 UTC 2018",
      "description": "<p><strong>About Us</strong></p>\n\n<p>Braintree lets you move money from one place to another safely and securely. Every time you pay for an Uber ride, book a stay through Airbnb, or pay with PayPal when you check out online, you’re probably using our product. It sounds complex (and it is), but we make it so simple you can’t tell we’re there.</p>\n\n<p>We solve world-scale problems and provide opportunities to match. We build diverse teams that recognize our strengths and allow us to work on our weaknesses. You bring skills and a relentless focus on the customer, and we'll provide the support you need to do the best work of your life.</p>\n\n<p><strong>The Engineering Team</strong></p>\n\n<p>Our focus is teaming with smart engineers who are passionate about their craft and excited to build software for our unique solutions in the space.</p>\n\n<p>At Braintree, developers have the chance to work on various teams and stacks. Although most of our software is written in Ruby, we believe in using the best tool for the job. For example, we’ve written data platforms in Clojure, payment gateways in Java, and contextual commerce in Python. </p>\n\n<p>-Communication is key to our process, and we don't want to hinder it with walls. Many teams program in pairs, which means you always have another set of eyes to help you.</p>\n\n<p>-We practice test-driven development and believe that it helps us deliver simple solutions focused on real customer needs. We have no QA department – developers test, release and monitor their own code.</p>\n\n<p>-We keep the team in sync with daily stand-ups and have regular retrospectives to discuss things that are going well and opportunities for improvements.</p>\n\n<p>-We value unique perspectives brought by diverse backgrounds and experiences. A broad range of ideas and perspectives help us to create the best possible product.\n </p>\n\n<p><strong>Types of projects we work on</strong></p>\n\n<p>Treasury - Our platform which drives financial disbursements to merchants around the world.</p>\n\n<p>Merchant Reporting - Delivering scalable data solutions to our partners: transaction records, payment methods, currencies, &amp; features.</p>\n\n<p>Onboarding - Building out a seamless on-boarding flow for Braintree merchants across our global markets.\n </p>\n\n<p><strong>What we look for in you</strong></p>\n\n<p>-5+ years experience building software or web applications with object oriented or functional programming languages. Doesn’t matter what language, just a focus on writing clean, well designed and scalable code</p>\n\n<p>-Ability and desire to work in our collaborative environment: open team room, pair programming and fluid interactions with all products and operations teams</p>\n\n<p>-Interest in TDD and specific experiences using a test heavy approach to solve problems and create solutions</p>\n\n<p>-Focus on building solutions utilizing an agile approach: close relationships with Product Managers, communicating and digesting real time feedback, and working smart to build story cards on daily basis</p>\n\n<p><strong>Perks</strong></p>\n\n<p>-Open dev days: every two weeks we spend a day working on projects that interest us and help us expand our skills and knowledge</p>\n\n<p>-Daily catered lunches, commuter reimbursement, educational assistance, untracked PTO, employee sabbatical program</p>\n\n<p>-Generous parental &amp; family leave policies</p>\n\n<p>-Participation in the technology community: we help cover travel and attendance costs for conferences, and we offer opportunities and tools for speaking</p>\n\n<p>Check out our <a href=\"https://www.braintreepayments.com/careers\">Careers Page</a> for more company perks.\n \nWe know the <strong>confidence gap</strong> and <strong>imposter syndrome</strong> can get in the way of meeting spectacular candidates. Please don't hesitate to apply. You can also check out our FAQ!</p>\n\n<p> </p>",
      "how_to_apply": "<p><a href=\"https://grnh.se/384f79941\">https://grnh.se/384f79941</a></p>",
      "id": "a1217bb0-602b-11e8-884c-e47a05d51ecc",
      "location": "Chicago, Illinois",
      "title": "Senior Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/a1217bb0-602b-11e8-884c-e47a05d51ecc"
    },
    {
      "company": "Nuon Energy N.V. / Vattenfall A.B.",
      "company_logo": "http://github-jobs.s3.amazonaws.com/7ab90e54-600b-11e8-9b02-586659f9ffde.jpg",
      "company_url": "https://www.nuon.com",
      "created_at": "Fri May 25 11:05:54 UTC 2018",
      "description": "<p><strong>Junior DevOps Engineer - Nuon</strong><br><br>\nEver considered working for an Energy Company? Now is the time!<br><br>\nVattenfall is in the transition to become <strong>fossil free in one generation</strong>, and we need your IT skills to make this happen! We are looking for Developers that would like to go full stack! The fast changing world around us, the speed of technology which disrupts the energy market and the big impact it has on society and customer expectations, needs our respond with digitalization, innovation and agility.<br><br><strong>Supporting your career</strong><br>\nWe are looking for talented and open minded colleagues that want to rockstart their IT career and meanwhile help us to achieve our goals in digitalisation, innovation and agility. If you are interested in working in a multidisciplinary Agile/DevOps team and already have some skills in Development, come join us!<br><br><strong>Some examples of what we are working on</strong>:</p>\n\n<ul>\n<li>To acquire new customers, we need to be creative and come with exciting solutions for our potential customers. You will be part of the Agile Team focusing on creating these market-changing propositions</li>\n    <li>Our existing customers need to get insight in their usage data, you will be part of the Agile team that is responsible for giving this insight and when calling our call center, it’s important that our agents are able to help you in a smooth way. Add to our digital platform strategy by enabling customers to complete their journey in an easy and simple way</li>\n    <li>For our Business to Business customers, it’s important that they get the individual attention and are taken care of in a good way by our innovative IT solutions. The team you will be part of is creating multiple portals to realize this ambition</li>\n    <li>Our colleagues need real time feedback and therefore we need you to further personalize the experience of the customer. To make our contact moments relevant and to the point we need to bring our call center platform to the next level. You will contribute in the team that enables our call center agents to be true ambassadors of our products</li>\n</ul><p><br>\nOur technologies vary from state-of-the-art Call Center products like Genesys, Nuance and NICE to self-built Java or .NET-platforms. For our digital platforms we make use of the modern possibilities of the Microsoft Azure cloud where we enable different frontend frameworks to surprise our customers. To store and present our customer data and execute the energy market processes we use SAP IS-U and Microsoft Dynamics.<br><br><strong>Role description</strong><br>\nThe Junior DevOps engineer has an end to end responsibility in the Agile delivery cycle:</p>\n\n<ul>\n<li>Challenge, advise our business and the business value and define acceptance criteria</li>\n    <li>Define technical solutions, define testing criteria (testable product)</li>\n    <li>Create, test and demonstrate a shippable product by programming, scripting and application configuration</li>\n    <li>Deploy and release a shippable product into production</li>\n    <li>Ensure automated monitoring and proactive alerting of customer journeys</li>\n</ul><p><br><strong>Requirements</strong></p>\n\n<ul>\n<li>You are able to work on <strong>bachelor/university level</strong>, are open minded, willing to learn and already have some <strong>experience</strong> in (front-end) <strong>development</strong> and would like to learn more</li>\n    <li>You enjoy working in teams</li>\n    <li>You are curious, like to <strong>think</strong> <strong>out-of-the-box</strong> and are interested in new solutions</li>\n    <li>You are a good <strong>communicator</strong>, not only with IT colleague’s</li>\n</ul><p><br><strong>Our offer</strong>:</p>\n\n<ul>\n<li>A permanent job, with lots of room for your development. There are plenty of trainings opportunities, learning from the best and working with the latest technologies</li>\n    <li>A central office location with easy access, by either public transport or car</li>\n    <li>A healthy work-life balance (smart working) and time to develop your profession as Engineer</li>\n    <li>The opportunity to work for a clean energy company that aims for creating fossil free energy within one generation</li>\n    <li>Working with energetic, motivated colleagues that like to have fun as well!</li>\n</ul><p><br><strong>Location</strong><br>\nWe are looking for candidates for our office in <strong>Amsterdam</strong> (near Arena stadium).<br><br><strong>Smart Working</strong><br>\nAt Vattenfall we promote smart working. Meaning you can easily combine work life with your private situation to ensure a healthy work life balance.<br><br><strong>About Vattenfall</strong><br>\nAt Vattenfall we exist to help our customers power their lives in ever climate smarter ways. The goal is to be free from fossil fuels within one generation. What this means for Vattenfall is to be innovative in areas like Solar Energy, Wind Energy, Electrification of roads and transportation but also digitalisation of our services to have better customer offerings and to improve our interactions with customers. We need your IT skills to make this happen!<br><br><strong>More information and further steps</strong><br>\nAn assessment is part of the procedure. For more information about the procedure please contact Iris Eveleens (Recruiter) via +31 6 15330697. For more information about us please visit our website <strong><a href=\"https://ltpx.nl/174nuvl\" target=\"_blank\">nuon.com</a></strong>.<br><br><strong>Interested?</strong><br>\nPlease apply via the <a href=\"https://ltpx.nl/uzRLiVB\" target=\"_blank\"><strong>application form</strong></a>.<br><br><em>Acquisition is not appreciated</em>.<img alt=\"\" src=\"https://bcontrol.brockmeyer.nl/track.php?orderid=46133\"></p>",
      "how_to_apply": "<p><a href=\"https://ltpx.nl/BLBL6on\" target=\"_self\">Click here to apply</a></p>",
      "id": "870c6fb6-600b-11e8-8386-056f39e7c6d0",
      "location": "Amsterdam",
      "title": "Junior DevOps Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/870c6fb6-600b-11e8-8386-056f39e7c6d0"
    },
    {
      "company": "Salmon Software",
      "company_logo": "http://github-jobs.s3.amazonaws.com/960787be-5e6a-11e8-8621-d32a5620dff2.jpeg",
      "company_url": "http://salmonsoftware.ie/",
      "created_at": "Fri May 25 08:04:31 UTC 2018",
      "description": "<p>Salmon’s mission is to further develop our system, the most sophisticated Treasury Management System software on the market, while continuing to deliver unrivalled excellence to our portfolio of Blue Chip clients. As a member of the Salmon development team you will be working out of our Olomouc office in Czech Republic.</p>\n\n<p>You will be primarily working on porting one of our applications to ASP.NET as well as improving it in the process. It's expected that in time you will begin participating on the development of our flagship product, Salmon Treasurer.</p>\n\n<p>Primary Responsibilities:</p>\n\n<ul>\n<li>Porting application to ASP.NET, development of new features, implementation of automated tests</li>\n<li>Developing modules and library functions as part of the general library of code</li>\n<li>Ensuring that the system operates on Microsoft Azure Platform as well as local client environments</li>\n<li>Organising and managing multiple priorities</li>\n<li>Reporting to the Senior Developer and to the Development Director as necessary</li>\n<li>Upholding and exemplifying Salmon’s culture of sustained excellence</li>\n</ul><p>Skills (Essential):</p>\n\n<ul>\n<li>Fluent English</li>\n<li>HTML5, CSS3, JavaScript</li>\n<li>Knowledge of SQL or Databases</li>\n</ul><p>(Desirable)</p>\n\n<ul>\n<li>ASP.NET MVC (C#) </li>\n<li>Computer Science, Information Technology or other related degree</li>\n<li>Microsoft Azure Platform </li>\n<li>Ruby-On-Rails </li>\n<li>MS SQL Server</li>\n<li>C++ </li>\n</ul><p>Why Work for Salmon Software?</p>\n\n<p>We realise here at Salmon that we are a small company – all of our competitors are multi-billion dollar enterprises. This works in our favour as we can offer to the successful candidate a position in our company that provides job satisfaction which cannot be matched by a large tech company.\nIf any of the reasons below appeal to you, then we want to hear from you!</p>\n\n<p>If you want to:</p>\n\n<ul>\n<li>Have a tangible impact within the company – No writing lines of mind-numbingly redundant code, your work matters to us and will be implemented in our solution</li>\n<li>Command a high level of responsibility &amp; autonomy – No micro-managing</li>\n<li>Contribute to the shakeup of global corporate finance practises – Some of the world’s biggest companies are our clients and we are actively growing that list</li>\n<li>Have a broad scope for career growth within the company</li>\n<li>Enjoy a strong team bond – We always look out for one another</li>\n<li>Work and collaborate with a team of rockstar developers – Our competitors (and most major tech companies) employ massive teams of developers that cannot and do not compete with our close-knit team of developers, in terms of quality in delivery of service. </li>\n</ul><p>Are you up to the task of joining them? We want to hear from you!</p>\n\n<p>Salary and benefits to be discussed with successful candidate. \nAs we are in a startup environment we are unfortunately unable to provide relocation assistance for those who apply from outside Czech Republic.</p>\n\n<p>Remote OK? No.</p>",
      "how_to_apply": "<p>Attach to an email your CV and a brief cover letter telling us why you would like to work at Salmon Software.</p>\n\n<p>Please send both to: <a href=\"mailto:jgbyrne@salmonsoftware.ie\">jgbyrne@salmonsoftware.ie</a></p>",
      "id": "15cf3a22-5ff2-11e8-98ce-93f367c76416",
      "location": "Olomouc, Czech Republic",
      "title": "Junior ASP.NET/C# Software Developer",
      "type": "Part Time",
      "url": "http://jobs.github.com/positions/15cf3a22-5ff2-11e8-98ce-93f367c76416"
    },
    {
      "company": "株式会社SmartHR",
      "company_logo": "http://github-jobs.s3.amazonaws.com/80cbeb0a-5fd8-11e8-946a-e3525959cf71.png",
      "company_url": "https://smarthr.co.jp/",
      "created_at": "Fri May 25 05:55:42 UTC 2018",
      "description": "<h1>会社について</h1>\n\n<p>株式会社 SmartHR は社会保険・雇用保険の手続きを自動化するクラウド人事労務ソフトウェア<a href=\"https://smarthr.jp/\">「SmartHR」</a>を開発しているスタートアップです。</p>\n\n<p>社会保障制度は、それ自体はすばらしい制度です。しかし、その手続きの不便さ、煩雑さ、わかりづらさは否めません。私たちはこのアナログな領域を、テクノロジーと創意工夫でもっとシンプル、かんたん、便利に変えていきます。</p>\n\n<h1>業務内容</h1>\n\n<p>私たちは<a href=\"https://smarthr.jp/\">「SmartHR」</a>を提供し、世の中のバックオフィス業務をよりシンプル、かんたん、便利に変えることで、価値のある仕事に集中できる世界を作っていくことをミッションとしています。</p>\n\n<p>1人の従業員が入社する度に作成・提出が必要な書類の枚数をご存知ですか？ 私たちの生活は、社会保険や労働保険など様々な制度によって守られていますが、その手続きは未だに複雑でアナログです。</p>\n\n<p><a href=\"https://smarthr.jp/\">SmartHR</a> では、蓄積された従業員データを元に、入退社手続きに必要な書類を自動で生成したり、総務省が提供する行政機関API(e-Gov)と連携することで業務の効率化を実現しています。また、これらの書類に用いられる従業員の人事データは常に最新で正しい情報であることが保証されているため、この情報を活用し人事・労務領域のみならず、企業向け・従業員向けを問わず様々なサービスを企画・開発していく狙いもあります。</p>\n\n<p><a href=\"https://smarthr.jp/\">SmartHR</a> のバックエンドシステムは今のところ大規模なトラフィックを捌いたりする必要はありませんが、レガシーな既存の制度をソフトウェアの力でモダンにしていくため、深いドメイン知識を身につけることを要求されます。あわせて不定期に発生する法改正やフォーマットの更新、利用ユーザ層の変化などを見据えた将来の変更に耐えうるソフトウェア設計・実装能力も期待されます。</p>\n\n<p>日々の業務においては新機能開発や既存機能の改修を中心として、企画・設計・開発・運用の一連の SaaS プロダクト開発に必要な全てのフェーズに携わっていただきます。また、風通しの良いオープンな社風を良しとしているため、エンジニアリング領域のみならず全社的・組織的な改善提案や議論についても自由に行うことができ、チームとして課題を解決していくことを最重要視しています。</p>\n\n<h2>直近の具体例</h2>\n\n<ul>\n<li>AWS + Heroku を活用したマイクロサービス化</li>\n<li>雇用契約書をオンラインで締結するサービスの新規開発</li>\n<li>サービスをより速く開発しリリースするための CI/CD 環境の改善・刷新</li>\n<li>外部サービスとの連携を実現する SmartHR API の機能拡充や性能改善</li>\n</ul><h1>必須要件</h1>\n\n<ul>\n<li>\n<a href=\"https://smarthr.co.jp/mission\">SmartHR のビジョン・ミッション・バリュー</a>に共感できる人</li>\n<li>Web アプリケーション開発の実務経験</li>\n</ul><h1>歓迎要件</h1>\n\n<ul>\n<li>Ruby on Rails による Web サービス開発・運用経験</li>\n<li>GitHub を用いた複数人での開発経験</li>\n<li>AWS / GCP を利用したインフラの運用経験</li>\n<li>SaaS / 業務ソフトウェアの開発経験</li>\n<li>OSS の公開やコントリビュートの経験</li>\n</ul><h1>こんな人と働きたい</h1>\n\n<ul>\n<li>技術が好きで勉強熱心な人</li>\n<li>学習したことをブログ・Qiitaへの投稿などで情報発信する人</li>\n<li>自動化が好きな人</li>\n</ul><h1>参考</h1>\n\n<ul>\n<li><a href=\"http://tech.smarthr.jp/\"> SmartHR Tech Blog</a></li>\n<li><a href=\"https://smarthr.co.jp/recruit/hello-world\">SmartHR Engineer Recruting</a></li>\n</ul><h1>スポンサー実績</h1>\n\n<ul>\n<li><a href=\"https://smarthr.co.jp/news/info/18756\">「Ruby Kaigi 2017」にプラチナスポンサーとして参加します</a></li>\n<li><a href=\"https://smarthr.co.jp/news/info/19539\">「Ruby25」にスポンサー出展します （2月24日 於：品川インターシティホテル）</a></li>\n<li><a href=\"https://smarthr.co.jp/news/info/19770\">「RubyKaigi 2018」にRubyスポンサーとして参加します</a></li>\n</ul>",
      "how_to_apply": "<p>こちらのページよりエントリーをお願いします。</p>\n\n<p><a href=\"https://smarthr.co.jp/recruit/hello-world#entry\">https://smarthr.co.jp/recruit/hello-world#entry</a></p>",
      "id": "08f508fc-5fe0-11e8-8b1d-662e22d19adc",
      "location": "東京",
      "title": "ソフトウェアエンジニア（バックエンド）",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/08f508fc-5fe0-11e8-8b1d-662e22d19adc"
    },
    {
      "company": "CircleCI",
      "company_logo": "http://github-jobs.s3.amazonaws.com/13ee09ca-5fcc-11e8-93e5-9465efb39d62.png",
      "company_url": "http://www.circleci.com",
      "created_at": "Fri May 25 03:32:04 UTC 2018",
      "description": "<p>As a Solutions Engineer at CircleCI, you will be the customer’s trusted advisor throughout the sales process. You will provide hands on support for single tenant deployment and product guidance with CircleCI’s largest customers.</p>\n\n<p><b>About CircleCI</b></p>\n\n<p>CircleCI is the best platform for software teams looking to rapidly build quality projects, at scale. Our intelligent continuous integration and delivery tools are simple yet powerful. Our aim is to provide the wisdom of a connected development ecosystem to every team member making technology decisions.</p>\n\n<p>We run 7M+ builds a month on our platform for companies like Spotify, Kickstarter, Sony, and Coinbase. Over 25,000 organizations and 300,000 developers actively build, test, and deploy on CircleCI.  We’ve raised $59.5M in venture capital from Industry Ventures, Top Tier Capital, Scale Venture Partners, DFJ, Harrison Metal Capital, and Baseline Ventures.</p>\n\n<p><b>About Sales Solutions at CircleCI</b></p>\n\n<p>Our Solutions Engineers have a strong understanding of the developer community and are able to confidently communicate with and provide first class support to developers, DevOps leads, and architects.</p>\n\n<p>We care deeply about diversity and inclusivity. We’re hiring at all experience levels, and seek talented teammates from a wide variety of backgrounds and experiences who are equally committed to cultivating a work environment of respect and kindness. We carefully consider every applicant that takes the time to apply.</p>\n\n<p><b>RESPONSIBILITIES</b></p>\n\n<ul>\n<li>Serve as the technical lead and owner of technical deal strategy</li>\n<li>Collaborate with Account Executive to identify and uncover customer business goals, needs, and pains, and work to show how CircleCI can address them</li>\n<li>Lead the technical implementation and day-to-day management of CircleCI Trials, integrated into our customer’s technology stack - ensuring early customer success and a long-term business relationship</li>\n<li>Prove the technical feasibility of the CircleCI platform to highly technical and developer audiences</li>\n<li>Stay on top of industry news, technology products, platforms and partners to ensure you and your team provide and maintain a deep industry and ecosystem expertise</li>\n<li>Identify areas of potential improvement in our sales efforts, and then work to improve them. This could be high level strategy, daily tactical efforts, or down in the weeks of creating documentation or how to videos</li>\n<li>Custom development and launch of new sales products and customer integrations to our internal teams and customer community</li>\n<li>Partner closely with our customer success teams to ensure continuity of an amazing customer experience - for life</li>\n<li>Collaborate closely with Product and Engineering teams to help influence product roadmap based on market/customer requirements</li>\n<li>Provide technical responses to RFPs and RFIs</li>\n</ul><p><b>REQUIREMENTS</b></p>\n\n<ul>\n<li>World class presentation skills. You feel comfortable leading presentations and demos of our platform to groups, both technical and non-technical, in-person and virtually</li>\n<li>Work with customers directly to debug common errors without involving an engineer</li>\n<li>You can tie business problems to technical solutions and understand technology value propositions</li>\n<li>Demonstrated and proven capacity to quickly absorb new concepts and technologies</li>\n<li>You have spent a decent amount of time using and scripting *nix</li>\n<li>You know how to work with Git in general and ideally GitHub in particular</li>\n<li>You’ve thrown together an app or two in a high-level programming language</li>\n<li>You believe that the best way for all to succeed is to honestly discuss product and company abilities and limitations with customers. We do not oversell at CircleCI</li>\n<li>Strong ops / infrastructure knowledge, especially networking and security</li>\n</ul><p><b>ADDITIONAL SKILLS</b></p>\n\n<ul>\n<li>Experience with build, test, and deployment automation</li>\n<li>Familiarity with Clojure and/or ClojureScript</li>\n<li>Knowledge of Docker or Linux containers in general</li>\n<li>Experience with popular web app frameworks (e.g. Rails, Django) and/or mobile app development (iOS, Android)</li>\n<li>Experience using and automating a major IaaS like AWS, GCP, or Azure</li>\n<li>Familiarity deploying and debugging distributed systems</li>\n</ul><p>If you’re interested in joining the team at CircleCI, please send a resumé and cover letter describing what inspires you and why you think you are a good fit for the team. If you contribute to an open source project, write a blog, or have a presence on the web (Twitter, GitHub, LinkedIn, etc.) we would love to hear about it.</p>",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/circleci/0c519ea3-d23f-4279-8818-f2b06ce8bf51?lever-origin=applied&amp;lever-source%5B%5D=GITHUB\">https://jobs.lever.co/circleci/0c519ea3-d23f-4279-8818-f2b06ce8bf51?lever-origin=applied&amp;lever-source%5B%5D=GITHUB</a></p>",
      "id": "1e200f24-5fcc-11e8-9968-174aac38bc5b",
      "location": "North America",
      "title": "Solutions Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/1e200f24-5fcc-11e8-9968-174aac38bc5b"
    },
    {
      "company": "Wag!",
      "company_logo": "http://github-jobs.s3.amazonaws.com/9a0a33c8-5fb1-11e8-8272-a46e3a9aa51d.png",
      "company_url": "https://wagwalking.com",
      "created_at": "Fri May 25 00:22:52 UTC 2018",
      "description": "<h1>Who we are</h1>\n\n<p>Wag! is an on-demand dog walking app that has been one of the fastest-growing startups this year, funded by some of Silicon Valley's top investors. We walk thousands of dogs in more than 100 cities every single day.</p>\n\n<h1>Who you are</h1>\n\n<p>You’re an iOS enthusiast who wants to innovate and help us out with our mission of making dog ownership easier. You thrive in a startup environment where you’ll juggle different priorities and iterate quickly.</p>\n\n<h1>What you'll get to do</h1>\n\n<p>In a word: innovate.</p>\n\n<p>You’ll build and contribute to the architectural and design decisions your team makes, and articulate the impact of those decisions. You’ll break down new features into releasable chunks, estimate release schedule, and work on creating the features with your team. You and your team get to create impactful features for our customers, and you’ll influence your team members to take ownership and always do the right thing.</p>\n\n<h1>What we offer</h1>\n\n<p>Love dogs? You’ll get to enjoy office dogs. We also have catered daily lunches and an open snack bar to nourish you and fuel your creativity.</p>\n\n<p>Of course, we also offer a competitive salary with stock options, along with medical, dental, vision, and life insurance.</p>\n\n<p>Here’s your chance to get in on the ground floor of a fast-growing startup!</p>\n\n<h1>What you'll need to get in the door</h1>\n\n<p>You have a proven ability to build, launch and iterate on apps.</p>\n\n<p>You have superior analytical skills and a strong sense of ownership in your work.</p>\n\n<p>You have a proven customer facing application development, troubleshooting, deployment and application performance tuning experience.</p>\n\n<p>You have very strong development skills in Objective C, iOS SDK, and good general programming and algorithm skills.</p>\n\n<p>You have at least 2 years of iOS app development experience.</p>\n\n<p><em>We look forward to learning more about you!</em></p>",
      "how_to_apply": "<p>Send your resume to <a href=\"mailto:brendan@wagwalking.com\">brendan@wagwalking.com</a></p>",
      "id": "a004948a-5fb1-11e8-9a46-6b96e73d1bc7",
      "location": "West Hollywood, CA",
      "title": "iOS Engineer at Wag!",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/a004948a-5fb1-11e8-9a46-6b96e73d1bc7"
    },
    {
      "company": "Daily Insight Group",
      "company_logo": "http://github-jobs.s3.amazonaws.com/deca7626-5fa2-11e8-8d18-afc20f77de45.png",
      "company_url": "http://tarot.com",
      "created_at": "Thu May 24 22:54:47 UTC 2018",
      "description": "<p><strong>Daily Insight Group</strong> (Zappallas) is seeking an innovative and technically curious Full Stack Developer to join our small, high performing team, building and supporting our network of sites – Tarot.com, DailyHoroscope.com, Numerology.com and Twittascope.com – across mobile, tablet, and desktop platforms.</p>\n\n<p>We care more about your attitude and aptitude than the specific tools and technologies you have used in the past. You need to have a strong passion for digital development and must take pride in your coding. You should also have great analytical and estimation skills and the ability to handle complex, modular software development in a collaborative team-based environment.\nOn the DIG Engineering Team, we pursue growth holistically, so you’ll have a chance to work on a diverse range of projects that reflect the areas where we see opportunity for impact.</p>\n\n<p><strong>You will:</strong></p>\n\n<ul>\n<li>As part of the Engineering team, enhance the technical execution of our growth strategy - spanning web products, data analytics, testing, and automation</li>\n<li>Be an integral part of the overall design and development process as we grow and enhance our user experience across the globe.</li>\n<li>Own development projects from backend to the presentation layer</li>\n<li>Participate in regular code reviews</li>\n<li>Build-out our modern architecture to enable us to more quickly ship new features into production at scale</li>\n<li>Develop and maintain our framework to serve the needs of different areas of the business – customers, advertisers, and partners</li>\n<li>Work through a variety of technical challenges that will require creativity and close collaboration across internal functions (Sales, Marketing, etc.)</li>\n<li>Learn more about eCommerce than you ever thought was possible </li>\n<li>Release early, release often (we love continuous integration)</li>\n</ul><p><strong>What We Offer:</strong></p>\n\n<ul>\n<li>A small dedicated team - we’re good at what we do and enjoy working together.</li>\n<li>Autonomy and respect from day one.</li>\n<li>An environment that is energized, flexible, and values tenacity.</li>\n<li>Health Benefits: DIG pays 100% of benefit premiums for medical, visual, and dental coverage for all U.S. full-time employees and 100% of their dependents' premiums.</li>\n<li>Vacation: 15 paid days per year plus 5 sick days.</li>\n<li>Perks: Unwind and renew in a \"Quiet/Relaxation Room\" with massage chairs. Enjoy a stocked kitchen with drinks and snacks. Pick of alternative work spaces throughout the office. Choose to work from home 1 day a week. Enjoy a monthly gym membership stipend.</li>\n</ul><p><em>We promote a healthy work/life balance, and are committed to continuous, iterative improvement of our tools, processes, and products, and we're looking for people who share these values who will contribute and share in our success.</em></p>\n\n<p><strong>Our Technology Stacks:</strong></p>\n\n<ul>\n<li>Frontend: Preact, Redux, Redux-Saga, Sass, Twig</li>\n<li>Backend: Python3, Django REST Framework, PHP, RabbitMQ</li>\n<li>Data: Redis, PostgreSQL, MySQL</li>\n<li>Build: Webpack, ES6/Babel</li>\n<li>Test: Karma/Mocha, PHPUnit, PyUnit, Selenium, SauceLabs</li>\n<li>Integrate: Docker, Saltstack, Debian, GitLab CI</li>\n<li>Process: Trello (Iterative/Kanban), GitLab Merge Requests, Slack</li>\n</ul><p><strong>Qualifications:</strong></p>\n\n<ul>\n<li>3+ years of experience working in a modern commercial software development environment and shipping solid product </li>\n<li>Demonstrated communication and collaboration skills</li>\n<li>Familiar with most of the following: Python3, PHP, MySQL, PostgreSQL, Node.js, Docker, Debian, Git</li>\n<li>Proficiency with front-end tools, such as: HTML, CSS, JavaScript, Frontend JS Frameworks (i.e, React)</li>\n<li>Solid understanding of the full web technology stack (e.g. HTTP, cookies, asset loading, caching, REST)</li>\n<li>Demonstrated design and UX sensibilities</li>\n<li>Rigor in A/B testing, test coverage, and other software development best practices</li>\n<li>Strong analytical and quantitative skills</li>\n</ul><p><strong>Nice to have:</strong></p>\n\n<ul>\n<li>Computer Science degree (preferred but not required)</li>\n<li>MicroServices architectural design experience</li>\n<li>Experience with automated software testing tools, such as Selenium, Saucelabs, or Katalon</li>\n<li>Familiarity with AWS Cloud Adoption Framework</li>\n</ul>",
      "how_to_apply": "<p>Email your resume and brief cover letter to:  <a href=\"mailto:resumes@dailyinsightgroup.com\">resumes@dailyinsightgroup.com</a></p>",
      "id": "913d43d2-5fa4-11e8-8616-faf87dacd6dd",
      "location": "Portland Oregon",
      "title": "Software Engineer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/913d43d2-5fa4-11e8-8616-faf87dacd6dd"
    },
    {
      "company": "Development Guild DDI, Inc.",
      "company_logo": "http://github-jobs.s3.amazonaws.com/80b9ea86-5f88-11e8-8edb-7d00d90eb4f5.png",
      "company_url": null,
      "created_at": "Thu May 24 19:28:30 UTC 2018",
      "description": "<p>The Full Stack Developer will be working on a platform with the mission to make the greatest possible positive impact on the world. This platform will perform at-scale to tackle the thorniest and most intractable problems facing organizations that serve humanity and the environment. If you’d like to work on something truly meaningful, this could be a dream job for you.</p>\n\n<p>This is an opportunity to work on an early-stage project, for someone who wants to dig deep, play a forward role, and take a lot of ownership. It’s ideal for someone who is excited by charting new technical territory, as we’re breaking significant ground. This position will report to the VP of Product, a leader in the data-product space who takes pride in developing talent on his team. </p>\n\n<p>This position will work out of Development Guild DDI’s New York (Manhattan) office. This is a full-time position.</p>\n\n<p>Required Technical Qualifications</p>\n\n<ul>\n<li>Node.js</li>\n<li>Relational database experience and data modeling</li>\n<li>Test-Driven Development</li>\n<li>Experience with a modern front-end framework such as React, Vue or Angular</li>\n<li>Cloud deployment</li>\n<li>Experience with build tools like Gulp/Grunt/Webpack</li>\n</ul><p>Other Qualifications</p>\n\n<ul>\n<li>Startup experience</li>\n<li>Strong analytic skills </li>\n<li>Excellent communication, interpersonal skills, and presentation skills</li>\n<li>Excellent follow-through ability; can manage multiple tasks and people with strong attention to detail, leading engineering teams</li>\n<li>Strong organizational skills</li>\n<li>High level of professionalism, diplomacy, and responsiveness</li>\n<li>Volunteer or other mission-driven experience</li>\n</ul><p>About Development Guild\nDevelopment Guild DDI, is a storied firm that has worked for the benefit of nonprofits serving education, social justice organizations, the arts and culture, the environment, and healthcare. </p>\n\n<p>For more information about Development Guild DDI, please visit <a href=\"http://www.developmentguild.com\">www.developmentguild.com</a></p>",
      "how_to_apply": "<p>Please email your cover letter and resume in confidence to:</p>\n\n<p><a href=\"mailto:fullstackdev@developmentguild.com\">fullstackdev@developmentguild.com</a></p>\n\n<p>Matthew Weber\nVICE PRESIDENT OF PRODUCT\nDevelopment Guild DDI</p>\n\n<p>All qualified candidates will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status.</p>",
      "id": "90e0a47c-5f88-11e8-90d3-a7b70a48fa17",
      "location": "New York, NY",
      "title": "Full Stack Developer",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/90e0a47c-5f88-11e8-90d3-a7b70a48fa17"
    },
    {
      "company": "Development Guild DDI, Inc.",
      "company_logo": "http://github-jobs.s3.amazonaws.com/0e7203b0-5f73-11e8-959f-4061c60ff067.png",
      "company_url": "https://www.developmentguild.com/",
      "created_at": "Thu May 24 19:24:18 UTC 2018",
      "description": "<p>The Director of Engineering will be working on a platform with the mission to make the greatest possible positive impact on the world. This platform will perform at-scale to tackle the thorniest and most intractable problems facing organizations that serve humanity and the environment. If you’d like to work on something truly meaningful, this could be a dream job for you. </p>\n\n<p>This is an opportunity to work on an early-stage project, for someone who wants to dig deep, play a forward role, and take a lot of ownership. It’s ideal for someone who is excited by charting new technical territory, as we’re breaking significant ground. This position will report to the VP of Product, a leader in the data-product space who takes pride in developing talent on his team. </p>\n\n<p>This position will work out of Development Guild DDI’s New York (Manhattan) office. This is a full-time position.</p>\n\n<p>Required Technical and Work Experience</p>\n\n<ul>\n<li>Experience managing a team of developers</li>\n<li>Experience architecting shipped products</li>\n<li>Node.js</li>\n<li>Relational database experience and data modeling</li>\n<li>Test-Driven Development</li>\n<li>Experience with a modern front-end framework such as React, Vue or Angular</li>\n<li>Cloud deployment</li>\n<li>Experience with build tools like Gulp/Grunt/Webpack</li>\n</ul><p>Other Qualifications</p>\n\n<ul>\n<li>Startup experience</li>\n<li>Strong analytic skills </li>\n<li>Excellent communication, interpersonal skills, and presentation skills</li>\n<li>Excellent follow-through ability; can manage multiple tasks and people with strong attention to detail, leading engineering teams</li>\n<li>Strong organizational skills</li>\n<li>High level of professionalism, diplomacy, and responsiveness</li>\n<li>Volunteer or other mission-driven experience</li>\n</ul><p>About Development Guild\nDevelopment Guild DDI, is a storied firm that has worked for the benefit of nonprofits serving education, social justice organizations, the arts and culture, the environment, and healthcare. </p>\n\n<p>For more information about Development Guild DDI, please visit <a href=\"http://www.developmentguild.com\">www.developmentguild.com</a></p>",
      "how_to_apply": "<p>Please email your cover letter and resume in confidence to: </p>\n\n<p><a href=\"mailto:directorofengineering@developmentguild.com\">directorofengineering@developmentguild.com</a></p>\n\n<p>Matthew Weber\nVICE PRESIDENT OF PRODUCT\nDevelopment Guild DDI</p>\n\n<p>All qualified candidates will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status.</p>",
      "id": "1251a0b2-5f73-11e8-9093-cc96d3527819",
      "location": "New York, NY",
      "title": "Director of Engineering",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/1251a0b2-5f73-11e8-9093-cc96d3527819"
    },
    {
      "company": "Sticker Mule",
      "company_logo": "http://github-jobs.s3.amazonaws.com/83d5b7b8-13f7-11e8-85ab-3e0e45789fa0.png",
      "company_url": "https://www.stickermule.com",
      "created_at": "Thu May 24 15:33:02 UTC 2018",
      "description": "<p>We created Sticker Mule to be the <strong>best place to work and shop</strong>. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work. <br></p>\n\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation. <br></p>\n\n<p><a href=\"https://stickermule.wistia.com/medias/1cms337413\">See more about our teams here</a></p>\n\n<p><strong>Why we enjoy working here</strong> <br> \n1. We work flexible hours with an asynchronous culture.<br> \n2. We work at a sustainable pace without unreasonable external deadlines.<br> \n3. Varied, interesting technical challenges to work on.<br> \n4. Opportunities to make a large impact as part of a small, highly motivated team.<br></p>\n\n<p><strong>Our tech stack</strong><br> \n1. Backend: Ruby on Rails, NodeJS, Go<br> \n2. DB: Aurora/Mysql, Postgres, Redis<br> \n3. Frontend:  React, Redux, Webpack<br> \n4. APIS: GraphQL, GRPC, GCloud PubSub<br> \n5. AWS, migrating to Gcloud<br> \n6. Docker, Kubernetes<br></p>\n\n<p><strong>What you will do</strong><br> \n1. Design, build, test, deploy and maintain web applications and services<br> \n2. Write clean, performant code in accordance with our team’s code style guidelines<br> \n3. Work to improve and maintain the code health of all our software<br> \n4. Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way<br> \n5. Participate in peer code reviewsShare expertise with other members of the team, mentor junior developers<br></p>\n\n<p><strong>About you</strong><br> \n1. You have a minimum of 3 years professional software development experience<br> \n2. You’re highly competent in JavaScript and have some experience with Ruby<br> \n3. You have experience building single page applications, ideally with with React<br> \n4. You possess strong analytical and critical thinking skills<br> \n5. You have great written and verbal communication skills in English<br></p>\n\n<p><strong>Application requirements</strong><br> \n1. Applicants will be sent a Hackerrank test within 1-3 days of applying.<br> \n2. Test must be completed within 5 days.<br></p>\n\n<p><strong>Compensation</strong><br> \n1. $90,000-$115,000+ depending on experience<br> \n2. Signing bonus<br> \n3. 28 days vacation<br></p>",
      "how_to_apply": "<p>Apply here only: <a href=\"https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf\">https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf</a></p>",
      "id": "8c9594fe-13f7-11e8-8d91-8eec43223096",
      "location": "Remote",
      "title": "Senior full-stack software engineer - JS + Ruby",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/8c9594fe-13f7-11e8-8d91-8eec43223096"
    },
    {
      "company": "Westwing Group GmbH",
      "company_logo": "http://github-jobs.s3.amazonaws.com/8da5a426-5f4a-11e8-9ffe-82536fb668a9.png",
      "company_url": "https://www.westwing.de/",
      "created_at": "Thu May 24 12:06:21 UTC 2018",
      "description": "<p><strong>Senior Site Reliability Engineer (m/f)</strong>\n<em>Location: Munich</em></p>\n\n<p>The Westwing mission is to inspire and make every home a beautiful home. We are on a quest to bring the wonders of eCommerce for home &amp; living to our more than 1,000,000 customers in 14 countries on three continents. In less than 7 years on the market, we have grown to more than 266 million Euros in annual sales. More importantly, the opportunity ahead of us is massive.</p>\n\n<p>The Westwing team is the secret to our success. Our more than 1,400 team members balance creativity and style with innovative technology and strong business fundamentals. We are proud to be working with inspiring colleagues who are smart, fun, ambitious, and looking for the challenge to transform an industry and take it into the future.</p>\n\n<p>Do you think this could be you? To pursue our ambitious growth strategy, we are looking for a Senior Site Reliability Engineer (m/f). In this position, you will be responsible for continuing to build out a first-class, innovative team embodying the Site Reliability Engineering philosophy and methodology.</p>\n\n<p><strong>Your responsibilities will be:</strong></p>\n\n<ul>\n<li>Work closely with software engineers and other SREs in dedicated engineering groups to influence and create monitoring, alerting and tracing platforms</li>\n<li>Write code so that you can automate repetitive manual tasks by building systems that can execute those tasks in an automatic fashion</li>\n<li>Help reduce technical debt and migrate off the legacy stack</li>\n<li>Be on-call for the services you build and support</li>\n</ul><p><strong>You come with:</strong></p>\n\n<ul>\n<li>Operational expertise around managing components like RDBMS and NoSQL databases, experience in at least one scripting language a good knowledge of Linux, networking, etc.</li>\n<li>Experience in operating highly available distributed systems in a cloud environment like AWS is a plus</li>\n<li>A good understanding of the observability landscape</li>\n<li>A thrill for troubleshooting faulty and misbehaving systems</li>\n<li>A passion for automation, building automatic systems and solving large complex infrastructure problems</li>\n<li>A proactive, goal-oriented, reliable and self-structured way of working</li>\n<li>Fluency in English</li>\n</ul><p><strong>We offer:</strong></p>\n\n<ul>\n<li>A truly shaping tech position with high degrees of responsibility and autonomy</li>\n<li>Plenty of room for personal growth and professional development (e.g. hackathons, certifications, budget for conferences)</li>\n<li>A position in a high-caliber Tech team with like-minded Engineers</li>\n<li>Entrepreneurial experience in a well-financed, leading eCommerce company</li>\n</ul><p><strong>Interested?</strong></p>\n\n<p>Looking forward to your full application under specification of your possible starting date and salary expectation.</p>\n\n<p><strong>Apply now</strong></p>\n\n<p>Westwing Group GmbH - \nMiriam Rabung - \nMoosacher Straße 88, 80809 Muenchen</p>\n\n<p><a href=\"mailto:jobs@westwing.de\">jobs@westwing.de</a></p>\n\n<p><a href=\"http://www.westwing.de\">www.westwing.de</a></p>",
      "how_to_apply": "<p><a href=\"https://www.westwing.de/joblist/#oI1o7fwY\">https://www.westwing.de/joblist/#oI1o7fwY</a></p>",
      "id": "bbcde6a6-5f4a-11e8-8ca1-d9301f8e0530",
      "location": "Munich",
      "title": "Senior Site Reliability Engineer (m/f)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/bbcde6a6-5f4a-11e8-8ca1-d9301f8e0530"
    },
    {
      "company": "Home24 SE",
      "company_logo": "http://github-jobs.s3.amazonaws.com/d0839002-5f3e-11e8-87af-685b09f1f14d.jpg",
      "company_url": "http://www.home24.de",
      "created_at": "Thu May 24 10:42:14 UTC 2018",
      "description": "<p>home24 is Europe’s biggest online shop for furniture and living space accessories. As the dynamic and fast growing market leader it’s our goal to provide our customers the best service and the best product assortment possible.<br></p>\n\n<p>home24 is currently active in 8 countries in Europe and Latin America. We have more than 1.000 employees worldwide and want to enlarge our team with top talent and engaged experts who are willing to grow and develop with us. Our dynamic and international team works with passion and enthusiasm on a big common goal: to revolutionize the Home &amp; Living market.<br></p>\n\n<p>For this challenge we are currently offering a position as:<br></p>\n\n<p><b>Software Engineer (m/f) for our SWAT team</b><br></p>\n\n<p><b>Your Responsibilities</b><br>\nAt Home24 we are strong believers in DevOps culture and \"you build it - you run it\" is one of our main principles. By \"you\" we mean \"team\", so no worries, you will not be left alone.<br>\nWe keep our engineers accountable for:<br></p>\n\n<ul>\n<li>Development: develop software according to department/common standards<br>\n</li>\n<li>Architect: define and implement scalable, resilient and maintainable solutions on application/service level<br>\n</li>\n<li>Operate: run and own systems, define operational KPIs and alerts, act on them<br>\n</li>\n<li>Improve: identify possible improvement, help in assembling of technical backlog<br>\n</li>\n<li>Learn: be able and willing to learn new stuff<br>\n</li>\n</ul><p><b>Your Profile</b><br></p>\n\n<ul>\n<li>You have expert knowledge of at least one open source programming language from the list: PHP (ideally), Golang (nice!), Python(ok), Delphi6 (joking :)) - you can check our tech stack in our tech radar<br>\n</li>\n<li>You have experience working on a cloud based infrastructure (AWS preferably) including docker<br>\n</li>\n<li>You have experience in continuous integration, test automation, and delivery processes<br>\n</li>\n<li>You are a fast learner, you have the passion for emerging technologies. You should be able to adapt easily to meet the rapid pace of evolving technologies<br>\n</li>\n<li>You are used to taking responsibility for delivering high-quality production ready code<br>\n</li>\n<li>You enjoy teamwork as well as sharing knowledge and best practices<br>\n</li>\n</ul><p><b>What we offer you</b><br></p>\n\n<ul>\n<li>The chance to make an impact!<br>\n</li>\n<li>Modern technology stack and openness to innovations<br>\n</li>\n<li>Good work-life balance<br>\n</li>\n<li>Professional growth and learning<br>\n</li>\n<li>The opportunity to work alongside a highly motivated team of tech professionals<br>\n</li>\n<li>An open-minded culture ready to incorporate new and creative ideas<br>\n</li>\n<li>Access to the Rocket Internet technology network<br>\n</li>\n<li>A freshly furnished office space showcasing our assortment<br>\n</li>\n<li>International colleagues from over 30 different countries<br>\n</li>\n<li>Relocation support for our international recruits<br>\n</li>\n<li>Benefits including employee discounts on all of our assortment, team events, free fruit and drinks, German language classes and more!<br>\n</li>\n</ul><p>If you want to become part of a thrilling success story – we are looking forward to your application. Please send us your CV and all relevant proofs together with your salary expectations and the earliest starting date possible via Jobvite or the application form.<br></p>\n\n<p><a href=\"https://home24.redirect.your-jobresponse.com/software_engineer_f_m_swat_team_berlin/209197/V819/anwenden\">Click here for the application form!</a><br></p>\n\n<p>home24 SE | Greifswalder Straße 212-213 | 10405 Berlin | Contact: Marta Gobbo<br></p>\n\n<p><i>Keywords: Vacancy, Full-time, Berlin, Software Engineer, Software Developer, IT Infrastructure, DevOps.</i><br></p>",
      "how_to_apply": "<p><a href=\"https://home24.redirect.your-jobresponse.com/software_engineer_f_m_swat_team_berlin/209197/V819/anwenden\">Click here for the application form!</a><br></p>",
      "id": "e313da88-5f3e-11e8-94f5-9dff3371487e",
      "location": "Berlin",
      "title": "Software Engineer (f/m) - SWAT team",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/e313da88-5f3e-11e8-94f5-9dff3371487e"
    },
    {
      "company": "Home24 SE",
      "company_logo": "http://github-jobs.s3.amazonaws.com/22cfa0ba-5f3c-11e8-8d88-9bc908c4d9bb.jpg",
      "company_url": "http://www.home24.de",
      "created_at": "Thu May 24 10:28:11 UTC 2018",
      "description": "<p>home24 is Europe’s biggest online shop for furniture and living space accessories. As the dynamic and fast growing market leader it’s our goal to provide our customers the best service and the best product assortment possible.<br></p>\n\n<p>home24 is currently active in 8 countries in Europe and Latin America. We have more than 1.000 employees worldwide and want to enlarge our team with top talent and engaged experts who are willing to grow and develop with us. Our dynamic and international team works with passion and enthusiasm on a big common goal: to revolutionize the Home &amp; Living market.<br></p>\n\n<p>For this challenge we are currently offering a position as:<br></p>\n\n<p><b>Senior Software Engineer (f/m) for our core team</b><br></p>\n\n<p><b>Your Responsibilities</b><br></p>\n\n<ul>\n<li>You will work with our core team on building new APIs to enable our customer experience teams building great products.<br>\n</li>\n<li>Have end to end ownership: design, implement, ensure quality, operate and extend our core platform APIs<br>\n</li>\n<li>You will work closely with our internal clients, our customer experience teams, and get direct feedback on your work<br>\n</li>\n</ul><p><b>Your Profile</b><br></p>\n\n<ul>\n<li>Expert knowledge of at least two open source programming languages ; ideally golang<br>\n</li>\n<li>Experience working on a cloud-based infrastructure and container technologies<br>\n</li>\n<li>You have experience in continuous integration, test automation and delivery processes and in service oriented systems<br>\n</li>\n<li>You are a fast learner, you have a passion for emerging technologies. You should be able to adapt easily to meet the rapid pace of evolving technologies<br>\n</li>\n<li>You are used to taking responsibility for delivering high-quality production ready code<br>\n</li>\n<li>You enjoy teamwork as well as sharing knowledge and best practices<br>\n</li>\n<li>BS or MS degree in Computer Science or a related technical field, also natural sciences possible<br>\n</li>\n</ul><p><b>What we offer you</b><br></p>\n\n<ul>\n<li>The chance to make an impact!<br>\n</li>\n<li>Modern technology stack and openness to innovations<br>\n</li>\n<li>Good work-life balance<br>\n</li>\n<li>Professional growth and learning<br>\n</li>\n<li>The opportunity to work alongside a highly motivated team of tech professionals<br>\n</li>\n<li>An open-minded culture ready to incorporate new and creative ideas<br>\n</li>\n<li>Access to the Rocket Internet technology network<br>\n</li>\n<li>A freshly furnished office space showcasing our assortment<br>\n</li>\n<li>International colleagues from over 30 different countries<br>\n</li>\n<li>Relocation support for our international recruits<br>\n</li>\n<li>Benefits including employee discounts on all of our assortment, team events, free fruit and drinks, German language classes and more!<br>\n</li>\n</ul><p>If you want to become part of a thrilling success story – we are looking forward to your application. Please send us your CV and all relevant proofs together with your salary expectations and the earliest starting date possible via Jobvite or the application form.<br></p>\n\n<p><a href=\"https://home24.redirect.your-jobresponse.com/senior_software_engineer_f_m_for_our_core_team_berlin/209179/V819/anwenden\">Click here for the application form!</a><br></p>\n\n<p>home24 SE | Greifswalder Straße 212-213 | 10405 Berlin | Contact: Marta Gobbo<br></p>\n\n<p><i>Keywords: Vacancy, Fulltime, Berlin, Software Engineer, Software Developer, Product Development, Golang, IT Infrastructure.</i><br></p>",
      "how_to_apply": "<p><a href=\"https://home24.redirect.your-jobresponse.com/senior_software_engineer_f_m_for_our_core_team_berlin/209179/V819/anwenden\">Click here for the application form!</a><br></p>",
      "id": "3801fce4-5f3c-11e8-8141-bbf85861d01f",
      "location": "Berlin",
      "title": "Senior Software Engineer (f/m) for our core team",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/3801fce4-5f3c-11e8-8141-bbf85861d01f"
    },
    {
      "company": "Unpublished yet",
      "company_logo": null,
      "company_url": null,
      "created_at": "Thu May 24 03:40:26 UTC 2018",
      "description": "<p>We are a compary offering financial products on the Ethereum Blockchain. We are looking for an experienced developer of Solidity smart contracts with some experience in backend development as well (Java, Ruby, JS...).\nPlease provide some references of your past projects, such as your github repository, with your candidature.</p>",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@mexens.com\">jobs@mexens.com</a></p>",
      "id": "11b816be-5f04-11e8-8c89-24815ab80d1e",
      "location": "Any",
      "title": "Solidity and backend developer",
      "type": "Contract",
      "url": "http://jobs.github.com/positions/11b816be-5f04-11e8-8c89-24815ab80d1e"
    },
    {
      "company": "sndr",
      "company_logo": "http://github-jobs.s3.amazonaws.com/b98ec0a6-5ebc-11e8-93ae-59fc5fd034de.jpg",
      "company_url": "https://www.sndr.com",
      "created_at": "Wed May 23 19:09:45 UTC 2018",
      "description": "<p>This position is full-time, reporting to an office in Orlando. No remote positions.</p>\n\n<p>About this role:</p>\n\n<p>As sndr DevOps administrator, you manage and support the needs of one of sndr server infrastructure systems. You're highly technical and work directly with other server and service owners to ensure reliability and sustainability of the sndr application stack as well as compliance with internal policies.</p>\n\n<p>Success in this role means you are able to support servers in a mixed operating system environment and work efficiently with our internal development team. In this role, you'll manage and support the needs of the business critical services running on sndr’s server infrastructure systems. We're always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>\n\n<p>About us:</p>\n\n<p>sndr is a secure enterprise communication and content sharing platform built to solve the rising problem of employees intentionally or unintentionally leaking information by circumventing corporate control and security measures, aka “shadow IT.” Until sndr, no single platform existed that combined industry-leading end to end cryptography, powerful end to end security and enterprise control, with seamless usability. Learn more at <a href=\"http://www.sndr.com\">www.sndr.com</a>.</p>\n\n<p>Responsibilities:</p>\n\n<p>Support sndr’s enterprise server and service environment.</p>\n\n<p>Ensure compliance of service infrastructure with sndr policies. Optimize existing environment based on business and security needs. Ensure the overall reliability and scalability of services that users are dependent on.</p>\n\n<p>Work with internal teams to collaborate on developing automated solutions.</p>\n\n<p>Minimum qualifications:</p>\n\n<p>BS degree in Computer Science or related field or equivalent practical experience.</p>\n\n<p>Mastery of Debian-based Linux OS administration</p>\n\n<p>Experience with Linux container technologies, including Docker and Kubernetes</p>\n\n<p>Must be able to obtain an interim Secret security clearance</p>\n\n<p>Preferred qualifications:</p>\n\n<p>Proficient in running, managing, sharding and scaling MongoDB</p>\n\n<p>Knowledge of TCP/IP networking, load balancing, workflow automation, security practices, web server software and LAN/WAN environments.</p>\n\n<p>Scripting experience in a multi-purpose language like Python, Perl or Go.</p>\n\n<p>Knowledge of Apache tuning and monitoring</p>\n\n<p>Experience implementing logging, monitoring and alerting frameworks</p>\n\n<p>Experience with git and svn repository management</p>\n\n<p>Experience with Jenkins continuous integration</p>\n\n<p>Job Type: Full-time</p>",
      "how_to_apply": "<p>Please send your resume to <a href=\"mailto:rebeccaevans@sndr.com\">rebeccaevans@sndr.com</a></p>\n\n<p>Or apply through Indeed: <a href=\"https://www.indeed.com/viewjob?t=devops+administrator&amp;jk=80708b8f31ff07e6&amp;_ga=2.248941123.556072701.1526910610-1809233537.1513093082\">https://www.indeed.com/viewjob?t=devops+administrator&amp;jk=80708b8f31ff07e6&amp;_ga=2.248941123.556072701.1526910610-1809233537.1513093082</a></p>",
      "id": "c23d3ffc-5ebc-11e8-8312-30c77ad370fe",
      "location": "Orlando",
      "title": "DevOps Administrator",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/c23d3ffc-5ebc-11e8-8312-30c77ad370fe"
    },
    {
      "company": "sndr",
      "company_logo": "http://github-jobs.s3.amazonaws.com/ef6c77bc-5eb8-11e8-99c2-68b2bf6ed6b5.png",
      "company_url": "https://www.sndr.com",
      "created_at": "Wed May 23 18:44:00 UTC 2018",
      "description": "<p>This position is full-time, reporting to an office in Orlando. No remote positions.</p>\n\n<p>Job Description:</p>\n\n<p>We are looking highly talented software developers with extensive practical knowledge of mobile, desktop, and enterprise application development. The role will include, but is not limited to, designing and coding user interfaces, enterprise RESTful services, and tools while working with a team of full stack engineers.</p>\n\n<p>About us:</p>\n\n<p>sndr™ is a secure enterprise communication and content sharing platform built to solve the rising problem of employees intentionally or unintentionally leaking information by circumventing corporate control and security measures, aka “shadow IT.” Until sndr™, no single platform existed that combined industry-leading end to end cryptography, powerful end to end security and enterprise control, with seamless usability. Learn more at <a href=\"http://www.sndr.com\">www.sndr.com</a>.</p>\n\n<p>Required:</p>\n\n<p>3+ years of software engineering experience</p>\n\n<p>Java 8 application development</p>\n\n<p>JavaFX UI design and development</p>\n\n<p>Strong passion for software engineering</p>\n\n<p>Expert knowledge of Object Oriented concepts</p>\n\n<p>Self-motivated to explore new technologies, applications and environments</p>\n\n<p>Strong user interaction and design sense</p>\n\n<p>Strong attention to detail</p>\n\n<p>Self-starter, highly motivated, team-player</p>\n\n<p>Our technology stack:</p>\n\n<p>JavaFX desktop</p>\n\n<p>Java SE distributed backend</p>\n\n<p>Protobuf</p>\n\n<p>Qualified candidates must be legally authorized to work in the United States. sndr™ does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position.</p>",
      "how_to_apply": "<p>send your resume to <a href=\"mailto:rebeccaevans@sndr.com\">rebeccaevans@sndr.com</a></p>\n\n<p>Or apply though Indeed:\n<a href=\"https://www.indeed.com/viewjob?t=sr+java+developer&amp;jk=f556a07fd9faab47&amp;_ga=2.40388070.556072701.1526910610-1809233537.1513093082\">https://www.indeed.com/viewjob?t=sr+java+developer&amp;jk=f556a07fd9faab47&amp;_ga=2.40388070.556072701.1526910610-1809233537.1513093082</a></p>",
      "id": "1f5cd6b0-5eb9-11e8-8531-9cd9fe4476f8",
      "location": "Orlando",
      "title": "Java Developer ",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/1f5cd6b0-5eb9-11e8-8531-9cd9fe4476f8"
    },
    {
      "company": "ConsejoSano, Inc.",
      "company_logo": "http://github-jobs.s3.amazonaws.com/69b56d1a-5eb1-11e8-87ba-5d1f3b0ca045.png",
      "company_url": "http://www.consejosano.com",
      "created_at": "Wed May 23 17:49:30 UTC 2018",
      "description": "<p>Interested in joining the ConsejoSano team? We're looking to bring on a full-time Senior Software Engineer for our Los Angeles office. To learn more, please send along your resume to <a href=\"mailto:careers@consejosano.com\">careers@consejosano.com</a>.</p>\n\n<p>We are looking for a well-rounded and experienced Senior Engineer to provide technical and engineering leadership to the most promising venture-backed, health care technology start-up in Southern California. The Senior Engineer will assist in the development of software, work to push forward efforts for automation and process improvement in collaboration with Engineering leadership, and serve as a key middle player between operations and deployment. We have an ambitious product vision and are looking for the right person with a love for programming and process improvement to join our in-house technology team and support the common goal. </p>\n\n<p>The right candidate will serve as a forward-thinking expert, contribute unique ideas for innovation to support the design and development of the product, and thrive in the start-up environment. An individual with Cloud application expertise and a user experience mindset will be a strong fit for the Senior Engineer role.</p>\n\n<p>We are developing a product that has changed, and will continue to improve, the lives of our users. We have assembled a team of passionate and intelligent individuals who genuinely enjoy coming to work each day. As we look to the next 18 to 24 months and beyond, we are excited to build out our platform and find an ambitious technical lead to grow and learn with us along the way.</p>\n\n<p>What you’ll actually <em>DO</em>:</p>\n\n<ul>\n<li>Assist in leading our engineering team as well as providing leadership in determining the strategy and direction of our entire software platform</li>\n<li>Contribute trusted expertise for the technical aspects of software implementations/integrations for our clients and partners</li>\n<li>Ability to work both independently and as a member of the Engineering team in software development and implementation</li>\n<li>Troubleshoot and provide solutions for complex engineering problems</li>\n<li>Report to the VP of Engineering and work closely to meet and exceed all current technical standards</li>\n<li>Provide clear, effective communication of objectives and issues as they arise</li>\n<li>Be seen as an approachable resource who facilitates knowledge sharing and encourages a culture of intellectual curiosity</li>\n<li>Be a student of current industry trends, ensuring that the company maintains and expands its technology leadership position</li>\n</ul><p>What you need to succeed:</p>\n\n<ul>\n<li>B.S. or M.S in a related Engineering discipline or Computer Science</li>\n<li>7+ years of software development experience, specifically building scalable SaaS products and analytics systems</li>\n<li>Our engineers work on the entire tech stack for a large, cloud-based SaaS application and experience with most of the following technologies is required:</li>\n<li>Strong Ruby on Rails experience</li>\n<li>Experience with Java Spring</li>\n<li>Proficient with web technologies such as JavaScript, jQuery, CSS3, and HTML5</li>\n<li>Experience with front end frameworks, preferably Angular or React, and REST APIs</li>\n<li>Strong experience with Git</li>\n<li>Experience with SQL and relational databases such as MySQL and PostgreSQL</li>\n<li>Strong TDD and Agile Development experience</li>\n<li>Experience with architecting and deploying applications on AWS </li>\n<li>Permanent U.S. citizenship (we are not sponsoring visas at this time)</li>\n</ul><p>We’d also love if you:</p>\n\n<ul>\n<li>Startup/small company experience with track record of developing high quality software</li>\n<li>Previous Health IT experience including exposure to hospital / health plan / health benefits systems</li>\n<li>Understanding of and experience developing HIPAA compliant products</li>\n<li>DevOps</li>\n</ul><p>Icing on the cake:</p>\n\n<ul>\n<li>Bilingual in Spanish or language other than English</li>\n<li>Prior experience in big-data analysis and understanding of machine-learning tools/natural language processing</li>\n</ul><p>About you:</p>\n\n<ul>\n<li>Desire to do hands-on engineering work and develop innovative solutions</li>\n<li>Strong technical responsibility over the products you work on and the codebases you maintain</li>\n<li>A highly-driven and entrepreneurial spirit with a user-experience mindset, professional and positive approach, self-motivated, innovative, strong in building relationships, great at being a team player, and a dynamic and engaging demeanor</li>\n</ul><p>It’s all about the perks, right?:</p>\n\n<ul>\n<li>Three weeks of paid vacation per year and eight annual holidays with two additional flex holidays</li>\n<li>Superb medical/dental/vision benefits with significant contributions toward covering all dependents</li>\n<li>Competitive salary and equity</li>\n<li>Healthy snacks</li>\n<li>Sponsored team outings (we are in one of the coolest neighborhoods in all the land)</li>\n<li>The ability to truly have a positive impact on people who need it most</li>\n<li>The support of a highly dedicated team focused on building the future of health care</li>\n</ul><p>About Us:\nAt ConsejoSano, we like to think of ourselves as constantly pushing the envelope to solve any number of issues for our users as they work to improve their own health. Our platform is used by our enterprise clients to enable patients to get the right care, at the right time, in the right place, and in the right way. We take pride in improving health outcomes through interacting with patients in revolutionary ways that are convenient to them and fit into their daily lives. With social determinants of health rapidly becoming an area of focus for our health care system, ConsejoSano is perfectly positioned to address these issues and use technology to scale our ability to help people live healthier lives.</p>\n\n<p>ConsejoSano was started approximately three years ago and is headquartered in the NoHo Arts district of Los Angeles County. Our team includes nationally recognized serial entrepreneurs, physicians, nurses, and an incredible team of sales and operations professionals. We raised our Series A in January of 2017 and are supported by top tier investors and some of the most recognized names in health care.</p>",
      "how_to_apply": "<p>Send us your resume at <a href=\"mailto:careers@consejosano.com\">careers@consejosano.com</a></p>",
      "id": "9373e46a-5eb1-11e8-996f-9159612c458c",
      "location": "North Hollywood, Los Angeles",
      "title": "Senior Full Stack Engineer (Ruby on Rails)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/9373e46a-5eb1-11e8-996f-9159612c458c"
    },
    {
      "company": "ConsejoSano",
      "company_logo": "http://github-jobs.s3.amazonaws.com/e9f978c4-5eaf-11e8-9236-4557a2dc6de4.png",
      "company_url": null,
      "created_at": "Wed May 23 17:40:59 UTC 2018",
      "description": "<p>Interested in joining the ConsejoSano team? We're looking to bring on a full-time Software Engineer for our Los Angeles office. To learn more, please send along your resume to <a href=\"mailto:careers@consejosano.com\">careers@consejosano.com</a>.</p>\n\n<p>We are looking for an innovative, knowledgeable and team-oriented Software Engineer with a user experience mindset to develop leading software at the most promising venture-backed, health care technology start-up in Southern California. The Software Engineer will assist in the design and development of special engineering projects and serve as an active member of the development team.</p>\n\n<p>A strong candidate for the Software Engineer role will have at least two years of professional engineering experience and possess strong Cloud application expertise. An understanding of the underlying infrastructure and the required elements coupled with the ability to assess challenges and independently develop a roadmap for productivity and resolution are key factors for success in this role.</p>\n\n<p>We are developing a product that has changed, and will continue to improve, the lives of our users. We have assembled a team of passionate and intelligent individuals who genuinely enjoy coming to work each day. As we look to the next 18 to 24 months and beyond, we are excited to build out our platform and find an ambitious technical lead to grow and learn with us along the way.</p>\n\n<p>What you'll actually do:</p>\n\n<ul>\n<li>Serve as an active member of the Engineering team in building great software and the development of solutions for current engineering problems</li>\n<li>Contribute trusted expertise and knowledge supporting the technical aspects of software implementations/integrations for our clients and partners</li>\n<li>Assist in troubleshooting while providing technical support and solutions for complex product and engineering problems</li>\n<li>Report to and collaborate with the VP of Engineering to meet and exceed all current technical standards</li>\n<li>Ability to work both independently and as a member of the team while providing clear, effective communication of objectives and issues as they arise</li>\n<li>Be seen as an approachable resource who facilitates knowledge sharing and encourages a culture of intellectual curiosity</li>\n</ul><p>What you need to succeed:</p>\n\n<ul>\n<li>B.S. or M.S in a related Engineering discipline or Computer Science</li>\n<li>4+ years of software development experience, specifically building scalable SaaS products and analytics systems</li>\n<li>Our engineers work on the entire tech stack for a large, cloud-based SaaS application and experience with most of the following technologies is required:</li>\n<li>Strong Ruby on Rails experience</li>\n<li>Experience with Java Spring</li>\n<li>Proficient with web technologies such as JavaScript, jQuery, CSS3, and HTML5</li>\n<li>Experience with front end frameworks, preferably Angular or React, and REST APIs</li>\n<li>Strong experience with Git</li>\n<li>Experience with SQL and relational databases such as MySQL and PostgreSQL</li>\n<li>Strong TDD and Agile Development experience</li>\n<li>Experience with architecting and deploying applications on AWS </li>\n<li>Permanent U.S. citizenship (we are not sponsoring visas at this time)</li>\n</ul><p>We'd also love if you:</p>\n\n<ul>\n<li>Startup/small company experience with track record of developing high quality software</li>\n<li>Previous Health IT experience including exposure to hospital / health plan / health benefits systems</li>\n<li>Understanding of and experience developing HIPAA compliant products</li>\n<li>DevOps</li>\n</ul><p>Icing on the cake:</p>\n\n<ul>\n<li>Bilingual in Spanish or language other than English</li>\n<li>Prior experience in big-data analysis and understanding of machine-learning tools/natural language processing</li>\n</ul><p>About you:</p>\n\n<ul>\n<li>Desire to do hands-on engineering work and develop innovative solutions</li>\n<li>A highly-driven and entrepreneurial spirit with a user-experience mindset, professional and positive approach, self-motivated, innovative, strong in building relationships, great at being a team player, and a dynamic and engaging demeanor</li>\n</ul><p>Some of the great perks of working at ConsejoSano include:</p>\n\n<ul>\n<li>Three weeks of paid vacation per year and eight annual holidays with two additional flex holidays</li>\n<li>Superb medical/dental/vision benefits with significant contributions toward covering all dependents</li>\n<li>Competitive salary and equity</li>\n<li>Healthy snacks</li>\n<li>Sponsored team outings (we are in one of the coolest neighborhoods in all the land)</li>\n<li>The ability to truly have a positive impact on people who need it most</li>\n<li>The support of a highly dedicated team focused on building the future of health care</li>\n</ul><p>About Us:\nAt ConsejoSano, we like to think of ourselves as constantly pushing the envelope to solve any number of issues for our users as they work to improve their own health. Our platform is used by our enterprise clients to enable patients to get the right care, at the right time, in the right place, and in the right way. We take pride in improving health outcomes through interacting with patients in revolutionary ways that are convenient to them and fit into their daily lives. With social determinants of health rapidly becoming an area of focus for our health care system, ConsejoSano is perfectly positioned to address these issues and use technology to scale our ability to help people live healthier lives.</p>\n\n<p>ConsejoSano was started approximately three years ago and is headquartered in the NoHo Arts district of Los Angeles County. Our team includes nationally recognized serial entrepreneurs, physicians, nurses, and an incredible team of sales and operations professionals. We raised our Series A in January of 2017 and are supported by top tier investors and some of the most recognized names in health care.</p>",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@consejosano.com\">careers@consejosano.com</a></p>",
      "id": "5d45ef74-5eb0-11e8-9f33-bee5caaf9678",
      "location": "North Hollywood, Los Angeles",
      "title": "Full Stack Engineer (Ruby on Rails)",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/5d45ef74-5eb0-11e8-9f33-bee5caaf9678"
    },
    {
      "company": "Global Obesity Prevention Center at Johns Hopkins University",
      "company_logo": "http://github-jobs.s3.amazonaws.com/9ee434dc-5e91-11e8-91e2-8f9a84693231.png",
      "company_url": "http://www.globalobesity.org/",
      "created_at": "Wed May 23 14:20:51 UTC 2018",
      "description": "<p><strong>General summary/purpose</strong></p>\n\n<p>The successful candidate will work with the members of the Global Obesity Prevention Center (GOPC) at Johns Hopkins University, Department of International Health, Health System Program from various Schools, Departments, and disciplines. The candidate will be based within the GOPC's Systems Science Core (SSC) and work with different project arms to program/develop computational modeling software and tools.</p>\n\n<p>The ideal candidate will be creative, analytical, and eager to take on responsibilities and learn new skills. S/he will work in a fast-paced and agile organization with a teamwork-oriented environment.</p>\n\n<p><strong>Specific duties &amp; responsibilities</strong></p>\n\n<ul>\n<li>Learn to run existing Python computational models</li>\n<li>Execute software under various configurations to produce data for projects</li>\n<li>Debug problems that arise in existing software</li>\n<li>Write code to solve issues</li>\n<li>Develop new capabilities for existing Python computational models</li>\n<li>Work with the team to implement new Python computational models in line with GOPC research \nprojects and matching model specifications</li>\n<li>Document code</li>\n<li>Write unite, functional, regression, and integration tests</li>\n<li>Have your code be reviewed and critiqued in an open and challenging way and review others’ code and provide valuable feedback to them</li>\n</ul><p><strong>Minimum qualifications</strong></p>\n\n<ul>\n<li>Bachelor’s degree</li>\n<li>One year of related experience</li>\n<li><em>Additional related experience may substitute for required education, to the extent permitted by the JHU equivalency formula.</em></li>\n<li><em>JHU Equivalency Formula: 18 graduate degree credits may substitute for one year of experience. For jobs where equivalency is permitted, up to two years of non-related college course work may be applied towards the total minimum education/experience required for the respective job.</em></li>\n</ul><p><strong>Preferred qualifications</strong></p>\n\n<ul>\n<li>Proficiency in Python</li>\n<li>A keen interest in programming / software development</li>\n<li>Strong interpersonal skills and the ability to work effectively with individuals at all levels and with diverse personalities in a collaborative environment</li>\n<li>Parallel computing/high-performance computing experience</li>\n<li>Strong problem solving and analytical/reasoning skills</li>\n<li>Excellent written and oral communication skills</li>\n<li><p>Ability to work independently and as part of a team</p></li>\n<li><p>Location: Johns Hopkins Bloomberg School of Public Health </p></li>\n<li><p>To apply please visit: <a href=\"https://career4.successfactors.com/sfcareer/jobreqcareer?jobId=10348&amp;company=jhu&amp;username=\">Programmer Analyst</a> OR <a href=\"https://career4.successfactors.com/sfcareer/jobreqcareer?jobId=10348&amp;company=jhu&amp;username=\">Programmer Analyst 2</a> <em>we are hiring two programmers</em></p></li>\n<li><p>Or email your CV to <a href=\"globalobesity@jhu.edu\">globalobesity@jhu.edu</a></p></li>\n<li><p><em>This position does not provide visa sponsorship</em></p></li>\n</ul>",
      "how_to_apply": "<p><a href=\"https://career4.successfactors.com/sfcareer/jobreqcareer?jobId=10348&amp;company=jhu&amp;username=\">https://career4.successfactors.com/sfcareer/jobreqcareer?jobId=10348&amp;company=jhu&amp;username=</a></p>",
      "id": "681f7fa8-5e94-11e8-8bfa-3ca9bb319b2a",
      "location": "Baltimore, MD",
      "title": "Programmer Analyst",
      "type": "Full Time",
      "url": "http://jobs.github.com/positions/681f7fa8-5e94-11e8-8bfa-3ca9bb319b2a"
    }
  ]
}
